{"2020-I-1":[{"situation":"A geometry problem where multiple segments are proven equal, leading to a chain of isosceles triangles.","suggestion":"Assign a single unknown angle (e.g., $\\beta$) to a key vertex angle and express all other angles in the figure solely in terms of $\\beta$ using the properties of isosceles triangles and the sum of angles in a triangle."},{"situation":"When points are collinear (e.g., $A, D, C$ lie on a line) and angles meet at the intermediate point $D$.","suggestion":"Use the supplementary angle relationship: the angles on one side of the line sum to $180^\\circ$. Specifically, $\\angle ADB + \\angle CDB = 180^\\circ$ if $D$ is between $A$ and $C$ (or use the angle addition postulate if the configuration is known)."},{"situation":"When an angle $\\angle XZY$ is partitioned by a ray $ZW$, and the geometric configuration is not immediately obvious (i.e., whether $W$ is inside or outside $\\angle XZY$).","suggestion":"Calculate the component angles ($\\angle XZW$ and $\\angle YZW$) based on the primary angle assignments. If the sum/difference yields a consistent result when equated to a known relationship (like $180^\\circ$ or another angle derived from a different part of the figure), the assumed configuration is confirmed."},{"situation":"When solving for the unknown angle $\\beta$ results in a linear equation involving $\\beta$ and $\\beta/2$ (e.g., $A\\beta - B = C - \\beta/2$).","suggestion":"Multiply the entire equation by 2 to clear the fraction, then isolate $\\beta$ to find the exact rational degree measure, $m/n$."}],"2020-I-2":[{"situation":"When terms of a sequence are defined using logarithms with different bases, and the terms must satisfy a multiplicative relationship (like forming a geometric progression).","suggestion":"Apply the change-of-base formula to convert all logarithms to a single common base (e.g., base 2 or the natural logarithm), substitute the resulting expressions into the relationship, and solve the resulting algebraic equation for the underlying variable (e.g., $y = \\log_b x$)."},{"situation":"When the algebraic solution to an equation yields multiple candidate values, but the problem imposes a constraint on the relationship between the terms (e.g., a common ratio must be positive, or a term must be non-zero).","suggestion":"For each candidate solution, explicitly calculate the sequence terms and the implied common ratio or relationship. Systematically check if the derived ratio/relationship satisfies the required condition (e.g., $r>0$ or $r \\neq 1$). Discard solutions that violate the necessary constraints."},{"situation":"When the derived algebraic equation for the variable $y$ (where $y=\\log_b x$) is a polynomial, and one solution is $y=0$.","suggestion":"If $y=0$ implies that one or more terms in the sequence are zero, check the problem constraints. If the relationship (e.g., geometric progression) requires a non-zero common ratio, verify that the sequence generated by $y=0$ does not force the ratio to be zero or undefined."},{"situation":"When the final answer requires the sum of the numerator and denominator ($m+n$) of a simplified fraction $x=m/n$ derived from an exponential equation.","suggestion":"Ensure the final value $x$ is written as a fraction of coprime positive integers by simplifying the base and exponent (e.g., $2^{-4} = 1/16$), and then calculate the required sum $m+n$."}],"2020-I-3":[{"situation":"When an integer N is represented in two different bases (e.g., base X and base Y) using the same set of digits, leading to two polynomial expressions for N.","suggestion":"Equate the two polynomial expressions, simplify to form a linear Diophantine equation involving the digits, and use the base constraints to narrow the search space."},{"situation":"When solving a linear Diophantine equation $Ax + By + Cz = D$ where the variables $x, y, z$ are constrained to small, finite, non-negative integer ranges (e.g., single digits in a specific base).","suggestion":"Isolate the term with the largest coefficient (or the term whose coefficient is most constrained by the range) and iterate through its possible values, substituting back to solve the resulting two-variable linear equation."},{"situation":"When minimizing an objective function $N = c_1 a + c_2 b + c_3 c + \\dots$ subject to constraints derived from a linear Diophantine equation involving $a, b, c, \\dots$ where the coefficients $c_i$ are ordered ($c_1 > c_2 > c_3$).","suggestion":"Systematically test the smallest possible values for the variable corresponding to the largest coefficient ($a$ in this case) until the first valid solution set $(a, b, c)$ is found; this solution will yield the minimum $N$."},{"situation":"When solving a two-variable linear equation $P b + Q c = R$ where $P$ and $Q$ are relatively prime, and $b$ and $c$ have strict upper bounds ($b \\le B_{max}, c \\le C_{max}$).","suggestion":"Use the constraint on the variable with the larger coefficient ($b$) to establish a small range of possibilities ($P b \\le R$), iterate through these possibilities, and check if the resulting value for $c$ satisfies $0 \\le c \\le C_{max}$."}],"2020-I-4":[{"situation":"When an integer $N$ is defined by concatenating a variable part $k$ with a fixed suffix $C$ (i.e., $N = k \\cdot 10^m + C$), and the condition requires $k$ to divide $N$.","suggestion":"Use the division property: since $k$ divides $k \\cdot 10^m$, the condition simplifies to requiring $k$ to divide the fixed part $C$. Find all such divisors $k$."},{"situation":"When the set of relevant integers $k$ is defined by being divisors of a specific number $C$, and the required final sum involves the sum of digits, $S(k)$.","suggestion":"List all divisors $k$ of $C$, calculate $S(k)$ for each, and sum these values. (If the list is long, look for pairing properties or digit patterns among the divisors, though direct enumeration is often feasible for AIME-level numbers.)"},{"situation":"When the structure of $N$ is $k$ followed by a fixed block $C$ (where $k$ is small enough that its digits do not overlap with the digits of $C$ when forming $N$).","suggestion":"Establish the additive property of the digit sum: $S(N) = S(k) + S(C)$. Use this to transform the required total sum $\\sum S(N)$ into $\\sum S(k) + (\\text{count of divisors}) \\times S(C)$."},{"situation":"When calculating the sum of digits for a set of numbers derived from divisors, and an intermediate sum (like $\\sum S(k)$) is prone to arithmetic error.","suggestion":"Verify the intermediate sum by grouping terms based on digit values or by calculating the sum using a different grouping order, especially if the number of terms is small (e.g., less than 20)."}],"2020-I-5":[{"situation":"When counting arrangements based on the property that removing one specific element yields a sequence with a specific ordering (e.g., ascending).","suggestion":"Fix the set of N-1 elements, determine the unique ordered sequence (T), and then count the number of ways the Nth element can be inserted into the N possible slots of T to generate the desired arrangements."},{"situation":"When two distinct sets of arrangements, $C_1$ and $C_2$, are constructed using complementary structural rules (e.g., one based on ascending subsequences and the other on descending subsequences).","suggestion":"Attempt to prove that the intersection $C_1 \\cap C_2$ is empty by assuming an element belongs to both, and deriving a contradiction based on the relative ordering constraints imposed by the two different structural rules on the common elements."},{"situation":"When an arrangement $A$ must satisfy two simultaneous removal conditions: removing $a_i$ yields sequence $T_A$ and removing $a_j$ yields sequence $T_D$ (where $T_A$ and $T_D$ have opposite monotonicity).","suggestion":"Analyze the ordering of the elements common to both resulting sequences ($S'' = S \\setminus \\{a_i, a_j\\}$). If $S''$ is non-empty, use the relative positions of elements in $S''$ within $A$ to constrain the required positions of $a_i$ and $a_j$, and check for consistency with the required ordering of $T_A$ and $T_D$."},{"situation":"When calculating the total count by summing the sizes of two sets ($|C_A| + |C_D|$), where the construction method for each set is identical except for the final ordering requirement (ascending vs. descending).","suggestion":"Verify that the counting mechanism (the number of choices for the set, and the number of insertion points) is independent of the specific ordering requirement, ensuring $|C_A| = |C_D|$ if the underlying set choices are the same."}],"2020-I-6":[{"situation":"When the vertical displacement (depth, $h$) of a sphere resting in a circular hole of radius $r$ is related to the sphere's radius $R$.","suggestion":"Apply the Pythagorean theorem to the right triangle formed by $R$ (hypotenuse), $r$ (horizontal leg), and $h$ (vertical leg) to establish the relationship $h^2 = R^2 - r^2$."},{"situation":"When two objects (like spheres) are separated by a known horizontal distance ($d$) and their centers are at different vertical positions ($h_1, h_2$).","suggestion":"Calculate the squared distance between the centers, $D^2$, using the 3D distance formula, resulting in $D^2 = d^2 + (h_1 - h_2)^2$."},{"situation":"When the distance between the centers of two tangent spheres ($D$) is known in terms of their common radius ($R$), i.e., $D=2R$.","suggestion":"Set the expression for $D^2$ derived from the geometry equal to $(2R)^2$ and substitute the expressions for $h_i$ derived from the hole radii to form an equation solely in terms of $R^2$."},{"situation":"When solving an equation involving the difference of two square roots, $\\sqrt{A} - \\sqrt{B} = C$, where $A$ and $B$ are linear functions of the variable $X$.","suggestion":"Isolate the radical term, square both sides, simplify the resulting quadratic equation, and critically check the resulting solution against the necessary condition imposed before the final squaring step (e.g., $C$ must have the correct sign relative to the isolated radical)."}],"2020-I-7":[{"situation":"When calculating the total number of ways $N$ to choose subsets based on two distinct groups of sizes $n_1$ and $n_2$, where the selection criteria link the sizes of the chosen subsets (e.g., $k_1 = k_2 + c$).","suggestion":"Attempt to rewrite the summation $\\sum_k \\binom{n_1}{k} \\binom{n_2}{k+c}$ into the form required by Vandermonde's Identity, $\\sum_k \\binom{n_1}{k} \\binom{n_2}{n_2 - (k+c)}$, and simplify the indices to match the standard form $\\sum_k \\binom{n_1}{k} \\binom{n_2}{m-k}$ to find $N = \\binom{n_1+n_2}{m}$."},{"situation":"When the problem requires finding the set of prime divisors of a binomial coefficient $\\binom{n}{k}$.","suggestion":"Apply Kummer's Theorem (or the equivalent Legendre's formula analysis): A prime $p$ divides $\\binom{n}{k}$ if and only if there is at least one carry when adding $k$ and $n-k$ in base $p$."},{"situation":"When analyzing the divisibility of $\\binom{n}{k}$ by primes $p$ such that $p > k$ (or $p > n-k$).","suggestion":"If $p > n-k$, then $E_p((n-k)!) = 0$. If $p > k$, then $E_p(k!) = 0$. If $p > n/2$, then $E_p(n!) = 1$. If $p$ is large enough such that $E_p(k!) = E_p((n-k)!) = 0$, then $p$ divides $\\binom{n}{k}$ if and only if $E_p(n!) = 1$ (i.e., $p \\le n < 2p$)."},{"situation":"When the final required answer is the sum of all prime factors of a calculated integer $N$ (especially if $N$ is a binomial coefficient).","suggestion":"List all primes $p$ up to $n$ (where $N=\\binom{n}{k}$), systematically check the divisibility condition (using Kummer's theorem or Legendre's formula) for each prime, collect the set of divisors, and compute their sum."}],"2020-I-8":[{"situation":"A path or position is defined by a sequence of steps where the length scales geometrically (e.g., $r^k$) and the direction rotates by a fixed angle $\\theta$ at each step.","suggestion":"Model the position as the sum of complex numbers $z = \\sum z_k$, where $z_k = d_k e^{i\\theta_k}$. Express this sum as an infinite geometric series $P = \\sum a r^j$ and use the formula $P = a/(1-r)$ after verifying $|r|<1$."},{"situation":"When calculating the sum of a complex geometric series $P = a/(1-r)$, where $r$ involves trigonometric functions (like $\\cos\\theta + i\\sin\\theta$).","suggestion":"Substitute the Euler form $e^{i\\theta}$ with its Cartesian form ($\\cos\\theta + i\\sin\\theta$), calculate the complex common ratio $r$, and then rationalize the denominator $1-r$ by multiplying the numerator and denominator by the conjugate $\\overline{1-r}$."},{"situation":"When the final answer requires the square of the distance from the origin to a complex point $P = x + iy$ derived from a convergent series.","suggestion":"Calculate the squared magnitude $|P|^2 = x^2 + y^2$ directly from the real and imaginary parts $(x, y)$ obtained after simplifying the complex sum, rather than calculating $|P|$ first."},{"situation":"When a final rational result $m/n$ is obtained, and the required answer is $m+n$ after ensuring the fraction is reduced.","suggestion":"Explicitly calculate $\\gcd(m, n)$ to confirm the fraction is in simplest form before summing the numerator and denominator."}],"2020-I-9":[{"situation":"When a divisibility chain $a_1 | a_2 | \\dots | a_k$ is imposed on divisors of a number $N = p_1^{e_1} p_2^{e_2} \\cdots$, and the exponents of the primes are independent variables.","suggestion":"Decompose the problem by prime factor. For each prime $p_i$, count the number of non-decreasing sequences of exponents $(x_{i,1}, x_{i,2}, \\dots, x_{i,k})$ such that $0 \\le x_{i,j} \\le e_i$. The total number of favorable outcomes is the product of these counts."},{"situation":"When counting the number of sequences $(x_1, x_2, \\dots, x_k)$ such that $0 \\le x_1 \\le x_2 \\le \\dots \\le x_k \\le n$ (non-decreasing sequences with replacement).","suggestion":"Apply the stars and bars technique for combinations with repetition: the count is $\\binom{n+k}{k}$ or equivalently $\\binom{n+k}{n}$."},{"situation":"When the total number of outcomes is $|S|^k$ and the favorable outcomes are $N_{\\text{fav}} = N_1 N_2 \\cdots$, leading to a probability ratio involving factorials and powers.","suggestion":"Instead of calculating the large numerator and denominator separately, express the terms using their factored forms (e.g., $\\binom{n}{k} = \\frac{n(n-1)\\cdots}{k!}$) and simplify the resulting fraction algebraically by canceling common factors before final multiplication."},{"situation":"When the total number of choices for an exponent is $E+1$ (i.e., exponents range from $0$ to $E$).","suggestion":"Use $n=E+1$ as the number of available items when applying the combinations with repetition formula $\\binom{n+k-1}{k}$ for a sequence of length $k$."}],"2020-I-10":[{"situation":"When analyzing divisibility conditions ($n^n \\mid m^m$) involving exponents, and one variable ($n$) has prime factors ($p$) that the other ($m$) lacks ($v_p(m)=0$).","suggestion":"Apply the $p$-adic valuation $v_p$ to the divisibility relation: $n \\cdot v_p(n) \\le m \\cdot v_p(m)$. If $v_p(m)=0$, this simplifies to $n \\cdot v_p(n) \\le 0$. Since $n \\ge 1$ and $v_p(n) \\ge 1$, this forces a contradiction, implying that any prime factor of $n$ must also divide $m$ (unless $n=1$)."},{"situation":"When a condition requires two integers $m$ and $n$ to be coprime to a fixed set of small primes (e.g., $\\gcd(m+n, 210)=1$), and another condition implies structural relationships between the prime factors of $m$ and $n$ (e.g., $p \\mid n \\implies p \\mid m$).","suggestion":"Use the coprimality condition to restrict the prime factors of $n$ (and $m$). Then, combine this restriction with the structural relationship derived from the divisibility condition. If the structural relationship forces $n \\mid m$ (or $m \\mid n$), check if this conflicts with a third condition (e.g., $n \\nmid m$). If a contradiction arises, test the boundary case $n=1$ or re-examine the initial structural deduction for edge cases."},{"situation":"When a set of constraints leads to a mathematical contradiction for all $n>1$, suggesting the problem statement might be flawed or the intended solution lies at the boundary case.","suggestion":"If the contradiction is robust (as derived from $p$-adic valuation analysis), test the boundary case $n=1$. If $n=1$ also fails a condition, systematically relax the most restrictive constraint (often the one involving coprimality or parity derived from a small modulus) and search for the smallest integer sum $m+n$ that satisfies the remaining, less restrictive structural requirements."}],"2020-I-11":[{"situation":"When polynomial roots are constrained to be integers, and the coefficients are related to the roots via Vieta's formulas.","suggestion":"Express the coefficients (like $c$ and $d$) in terms of the roots ($y_1, y_2$). If the roots themselves are linear functions of other integer parameters (like $a$ and $b$), substitute these expressions to derive a linear constraint solely on the parameters $a$ and $b$ using the coefficient bounds."},{"situation":"When counting integer solutions $(a, b)$ subject to three independent linear inequalities: $|a| \\le A$, $|b| \\le B$, and $L(a) \\le 3a + b \\le R(a)$ (where $L$ and $R$ are derived from the constraints on $c$).","suggestion":"Iterate over the smaller domain (e.g., $a \\in \\{-A, \\dots, A\\}$). For each fixed $a$, rewrite the central inequality as a range for $b$: $\\max(-B, L(a) - 3a) \\le b \\le \\min(B, R(a) - 3a)$. Count the number of integers $b$ in this resulting intersection range and sum these counts."},{"situation":"When a counting problem involves a linear expression $3a+b$ constrained between two constants, and $a$ and $b$ are bounded symmetrically (e.g., $|a|, |b| \\le 10$).","suggestion":"Analyze the constraint $K_1 \\le 3a+b \\le K_2$ by partitioning the domain of $a$ based on where the bounds $K_1$ and $K_2$ interact with the fixed bounds of $b$ (i.e., where $K_1 - b$ or $K_2 - b$ crosses the boundaries $\\pm 10$). This allows for systematic summation over $a$ using arithmetic series formulas for the resulting counts."}],"2020-I-12":[{"situation":"When solving $a^n \\equiv b^n \\pmod{p^k}$ where $p$ is prime and $p \\nmid a, p \\nmid b$.","suggestion":"Rewrite the congruence as $(a b^{-1})^n \\equiv 1 \\pmod{p^k}$ and find the multiplicative order of $x = a b^{-1}$ modulo $p^k$ using the Chinese Remainder Theorem structure (finding the order modulo $p, p^2, \\dots, p^k$ sequentially)."},{"situation":"When finding the order $k = \\operatorname{ord}_{p^e}(x)$ and you have already found the order $k_1 = \\operatorname{ord}_{p^j}(x)$ where $j < e$.","suggestion":"Calculate $x^{k_1} \\pmod{p^{j+1}}$. If $x^{k_1} = 1 + m p^j$ where $p \\nmid m$, apply the order lifting formula: $\\operatorname{ord}_{p^e}(x) = k_1 \\cdot p^{e-j}$."},{"situation":"When solving $a^n \\equiv b^n \\pmod{p^k}$ where $p$ is an odd prime and $p$ divides the difference $a-b$ (i.e., $a \\equiv b \\pmod p$ but $a \\not\\equiv b \\pmod{p^2}$ or $a \\not\\equiv b \\pmod p$ is not the case).","suggestion":"Use the Lifting The Exponent Lemma (LTE) on the $p$-adic valuation: $v_p(a^n - b^n) = v_p(a-b) + v_p(n)$. Set this valuation equal to the required exponent $k$ to find the minimum required $v_p(n)$."},{"situation":"When the required exponent $n$ is the least common multiple of several independent constraints derived from prime power moduli, $n = \\operatorname{lcm}(n_1, n_2, \\dots)$.","suggestion":"Find the prime factorization of each $n_i$. The factorization of $n$ is formed by taking the maximum exponent for every prime present across all $n_i$ factorizations."}],"2020-I-13":[{"situation":"A point is defined as the intersection of an angle bisector (e.g., BE) and the perpendicular bisector of a segment originating from the vertex (e.g., AD).","suggestion":"Investigate the circumcircle of the triangle formed by the vertex and the segment endpoints (e.g., circumcircle of triangle ABD). The intersection point (E) is often a key point on this circle."},{"situation":"When a point P is equidistant from two points (A and D) and also equidistant from two lines intersecting at a vertex (B, C), implying P lies on the perpendicular bisector of AD and an angle bisector of B or C.","suggestion":"Use the property that P lies on the angle bisector to relate distances to the sides, and use the property that P lies on the perpendicular bisector to set up an equality of distances (PA = PD). Combine these to find geometric constraints."},{"situation":"When calculating angles within a triangle where the side lengths are known and the angle bisector divides the opposite side into known segments (e.g., AD is the angle bisector).","suggestion":"Use the Law of Cosines on the two smaller triangles formed by the bisector (e.g., $\\triangle ABD$ and $\\triangle ACD$) to relate the known side lengths and segment ratios to the cosines of the original angles."},{"situation":"When attempting to prove collinearity or concurrency involving points constructed via angle bisectors and perpendicular bisectors, leading to complex angle chasing that stalls.","suggestion":"Switch from pure angle chasing to coordinate geometry or vector methods, or look for a synthetic argument that directly uses the power of a point theorem or radical axis, as the initial complex angle relationships might be equivalent to a simpler circle property."}],"2020-I-14":[{"situation":"A polynomial $P(x)$ of degree $n$ is composed with itself, $P(P(x))=0$, and the roots of the resulting polynomial are known to partition into sets based on which intermediate root they satisfy.","suggestion":"If $P(x)$ is quadratic, $P(x) = x^2 + cx + d$, recognize that the roots of $P(x)=r_i$ all share the same linear coefficient, $-c$. This forces the set of all roots to be partitionable into pairs (or sets of size $n$) whose sums are equal to $-c$."},{"situation":"When a set of four numbers $\\{r_1, r_2, r_3, r_4\\}$ must be partitioned into two pairs $\\{r_a, r_b\\}$ and $\\{r_c, r_d\\}$ such that $r_a + r_b = r_c + r_d$.","suggestion":"Systematically list the three possible ways to form these pairs, set the sums equal, and solve the resulting linear constraints on the variables."},{"situation":"When the existence of a solution depends on whether the intermediate roots $r_1$ and $r_2$ (roots of $P(y)=0$) are distinct, which affects whether the four final roots are distinct.","suggestion":"If $r_1 = r_2$, then $P(y)=0$ has a double root, implying its discriminant is zero. Check the condition for the discriminant of $P(y)=0$ (which involves $c$ and $d$) against the constraints derived from the root partitioning to ensure the case $r_1=r_2$ is impossible or leads to a contradiction."},{"situation":"When a case analysis yields multiple possible values for a target expression (like $(a+b)^2$) based on how the variables were grouped.","suggestion":"Sum all distinct possible values obtained from the exhaustive case analysis, provided each case was verified to be mathematically possible (i.e., coefficients $c$ and $d$ can be found)."}],"2020-I-15":[{"situation":"When a geometric configuration involves the circumradius R, the distance from the circumcenter O to the orthocenter H (OH), and the length of a segment HA connecting H to a vertex A.","suggestion":"Apply the relationship $R^2 - OH^2 = 2R^2 \\cos A \\cos B \\cos C$ (Euler's formula for $OH^2$) alongside the Law of Cosines applied to $\\triangle OHA$ or the relationship $HA = 2R |\\cos A|$ to establish a relationship between $R, OH,$ and the angles."},{"situation":"When a point H (like the orthocenter) is defined relative to a triangle, and its distance to a vertex A (HA) is known, and the configuration involves the circumcircle $\\omega$ of radius R.","suggestion":"Use the Power of a Point theorem applied to H with respect to $\\omega$ ($R^2 - OH^2 = \\pm 12$ in this context) to link the known distance HA to the circumradius R and the distance OH."},{"situation":"When the area K of a triangle is expressed in terms of the circumradius R and one side length (or related quantity, like $HA=3$ which implies a fixed angle $A$ via $HA=2R \\cos A$).","suggestion":"Express the area $K$ using the formula $K = 2R^2 \\sin A \\sin B \\sin C$. Substitute known angle relations derived from the fixed side/distance constraint to isolate $R$ or a function of $R$ in the area formula."},{"situation":"When an algebraic derivation based on geometric constraints yields multiple possible values for a squared quantity (like $R^2$), but only one path seems consistent with the initial setup (e.g., $OH^2 > 0$ or $R^2$ must be large enough).","suggestion":"Systematically check the consistency of the derived values against the initial geometric assumptions (e.g., whether H is inside or outside the circle, $OH^2 > 0$, or if the resulting triangle inequality holds). If all paths lead to contradictions, re-examine the fundamental geometric formulas used (e.g., the specific form of the power of a point or the distance formula used)."},{"situation":"When the final required answer format (e.g., $m+n$) suggests that the calculated quantity (like Area $K$) must result in an expression of the form $C \\sqrt{D}$ where $C$ is an integer, but the direct calculation yields a non-integer coefficient.","suggestion":"Test the hypothesis that the required form applies to $2K$ or $K^2$ instead of $K$. If $K = (m/2)\\sqrt{n}$, assume the intended answer involves $m$ and $n$ derived from $2K = m\\sqrt{n}$."}],"2020-II-1":[{"situation":"When an integer $N$ is factored into a product of powers of distinct primes, $N = p_1^{e_1} p_2^{e_2} \\cdots$, and we seek the number of ways to write $N$ as a product $m \\cdot n$ where $m$ and $n$ have specific forms involving those same primes.","suggestion":"Express $m$ and $n$ using the same prime basis, $m = p_1^{a_1} p_2^{a_2} \\cdots$ and $n = p_1^{c_1} p_2^{c_2} \\cdots$, and equate the exponents to form a system of independent linear equations for each prime base."},{"situation":"When solving a linear Diophantine equation of the form $Ax + By = C$, where $x$ and $y$ must be non-negative integers ($x \\ge 0, y \\ge 0$).","suggestion":"Isolate the variable with the smaller coefficient (or the one whose coefficient is 1), use the non-negativity constraint on the other variable to establish an upper bound, and count the number of integer solutions within that bounded range."},{"situation":"When the total number of solutions to a problem is determined by independent choices related to different prime factors of a constant.","suggestion":"Calculate the number of valid exponent combinations for each prime factor separately, and then multiply these counts together to find the total number of pairs $(m, n)$."}],"2020-II-2":[{"situation":"When a probability condition depends on the slope between a random point $(x, y)$ in a bounded region (like the unit square) and a fixed point $Q=(x_Q, y_Q)$.","suggestion":"Define the boundary condition (equality of slopes) to find the line $L$ passing through $Q$. Analyze the resulting inequality by splitting the domain based on whether the denominator $(x - x_Q)$ is positive or negative, leading to regions defined by being above or below $L$."},{"situation":"When the favorable region defined by a linear inequality within a rectangle (or square) is split into two parts by a vertical line passing through a known interior point $Q$.","suggestion":"Calculate the area of each resulting sub-region (which will be trapezoids or triangles) by finding the intersection points of the boundary line $L$ with the rectangle's edges, and then use the trapezoid area formula based on the vertical segments."},{"situation":"When calculating the area of a region bounded by a line segment $L$ and two vertical lines $x=a$ and $x=b$, where the line $L$ is $y = mx + c$.","suggestion":"Use the trapezoid area formula: Area $= \\frac{y(a) + y(b)}{2} \\cdot |b - a|$, where $y(a)$ and $y(b)$ are the heights (y-coordinates) of the line $L$ at $x=a$ and $x=b$ respectively."},{"situation":"When the final answer requires the sum of two coprime integers ($m+n$) derived from a simplified probability fraction $m/n$.","suggestion":"Ensure the final fraction is fully reduced by checking for common factors, especially if the denominator is a power of a prime (like $2^k$)."}],"2020-II-3":[{"situation":"An equation involves logarithms where both the base and the argument are expressed as powers of some common underlying numbers (e.g., $\\log_{b^k} a^p = \\log_{c^m} d^q$ where $b, a, c, d$ are related).","suggestion":"Use the change-of-base formula or the specific property $\\log_{b^k} a = \\frac{1}{k} \\log_b a$ to rewrite all terms using a common, simpler base (like the smallest prime base involved), effectively isolating the variable terms in the denominators or numerators."},{"situation":"After simplifying a logarithmic equation, the resulting algebraic equation involves only rational functions of the variable (e.g., $\\frac{A}{x} = \\frac{B}{x+C}$).","suggestion":"Cross-multiply to eliminate the denominators, resulting in a linear or quadratic equation, and solve for the variable. Ensure the solution does not violate the domain restrictions (e.g., bases cannot be 1, arguments must be positive)."},{"situation":"The final answer requires the sum of the numerator and denominator ($m+n$) of a rational solution $x=m/n$, where $m$ and $n$ must be coprime positive integers.","suggestion":"Reduce the fraction $x$ to its lowest terms by dividing the numerator and denominator by their greatest common divisor (GCD) before summing them."}],"2020-II-4":[{"situation":"When a rigid transformation (rotation, reflection, translation) maps one set of points to another, and the angle of rotation or axis of reflection is unknown.","suggestion":"If the transformation is a rotation, determine the angle by comparing the vectors formed by corresponding non-coincident points (e.g., $\\vec{AB}$ and $\\vec{A'B'}$). If the angle is $m$, the relationship between the vectors $(v_x, v_y)$ and $(v'_x, v'_y)$ must satisfy the rotation matrix equations."},{"situation":"When the center of rotation $(x,y)$ is unknown, but the angle of rotation $m$ is known (or determined).","suggestion":"Set up a system of two linear equations by enforcing the distance constraint: the center $(x,y)$ must be equidistant from a pair of corresponding points, i.e., $(x-x_A)^2 + (y-y_A)^2 = (x-x_{A'})^2 + (y-y_{A'})^2$. Simplify this equation to find the perpendicular bisector line, and repeat for a second pair of points to find the intersection."},{"situation":"When the angle of rotation $m$ is determined to be $90^\\circ$ (or $270^\\circ$) clockwise or counterclockwise.","suggestion":"Use the specific coordinate transformation rule for that angle: for a $90^\\circ$ clockwise rotation around the origin, $(u, v) \\to (v, -u)$. If the rotation is around a center $(x,y)$, apply the transformation to the relative coordinates: $(u-x, v-y) \\to (v-y, -(u-x))$, and then shift back by adding $(x,y)$."},{"situation":"When multiple geometric constraints (like perpendicular bisectors or distance equalities) are derived and must be simultaneously satisfied.","suggestion":"Solve the resulting system of linear equations algebraically. If the system is derived from geometric properties (like perpendicular bisectors), ensure the resulting intersection point is verified against the third pair of points to confirm consistency."}],"2020-II-5":[{"situation":"When minimizing an integer $N$ subject to a constraint on the sum of its digits in a specific base $b$ (i.e., $S_b(N) = K$).","suggestion":"To minimize $N$, first determine the minimum number of digits required, $k = \\lceil K / (b-1) \\rceil$. Then, construct $N$ by assigning the smallest possible non-zero value to the most significant digit, and assigning the largest possible digit ($b-1$) to the remaining $k-1$ positions, adjusting the leading digit if necessary to meet the sum $K$ exactly."},{"situation":"When an integer $M$ is constrained by the sum of its digits in base $b$, $S_b(M) = K$, and $M$ must be minimized.","suggestion":"Minimize $M$ by minimizing the number of digits first. If the number of digits is fixed, minimize the leading digit, ensuring the remaining digits can sum to the required remainder using the maximum digit value $(b-1)$."},{"situation":"When calculating $a^k \\pmod{m}$ where $m$ is composite, especially $m=1000$ or $m=10^n$.","suggestion":"Use the Chinese Remainder Theorem by factoring $m$ into coprime factors (e.g., $1000 = 8 \\times 125$). Calculate the congruence modulo each factor separately, utilizing the fact that for $m=2^a$, $a^k \\equiv 0 \\pmod{m}$ if $k$ is large enough (i.e., $k \\ge a$). Then, combine the results using the CRT."},{"situation":"When a required value $X$ is expressed as $X = b^k - 1$ or $X = c \\cdot b^k - 1$, where $b$ is a power of 2 (e.g., $b=4$ or $b=16$).","suggestion":"Rewrite the expression in terms of powers of 2, $X = 2^p - 1$, and use known modular arithmetic results for powers of 2, or apply the property that $2^p - 1$ is a string of $p$ ones in base 2."}],"2020-II-6":[{"situation":"A sequence is defined by a non-linear recurrence relation involving products of terms, such as $t_n = f(t_{n-1}, t_{n-2})$.","suggestion":"Rearrange the recurrence into a multiplicative form (e.g., $t_n t_{n-2} = g(t_{n-1})$) and calculate the first few terms explicitly, looking for a repeating pattern or cycle."},{"situation":"When calculating terms in a sequence defined by a recurrence, intermediate terms involve complex fractions, but the structure suggests a clean cycle might exist.","suggestion":"Focus on simplifying the expression for the term that closes the cycle (e.g., $t_{k+1}$ or $t_{k+2}$) by using the prime factorization of the preceding terms to check for cancellations that reveal the initial values."},{"situation":"A sequence defined by a recurrence relation is found to be periodic with period $k$ after calculating $t_{k+1}=t_1$ and $t_{k+2}=t_2$.","suggestion":"Determine the index $N$ modulo the period $k$ (i.e., find $N \\pmod k$) to map the desired term $t_N$ back to one of the initial $k$ calculated terms ($t_1, t_2, \\ldots, t_k$). If $N \\equiv 0 \\pmod k$, the term is $t_k$."},{"situation":"The final answer requires the sum of the numerator and denominator ($p+q$) of a reduced fraction $p/q$ obtained from a sequence calculation.","suggestion":"Verify that the numerator and denominator are coprime by checking for common factors, especially using the prime factorization of the denominator against the numerator."}],"2020-II-7":[{"situation":"When finding the minimum distance from the origin to a surface defined implicitly by a function $F(x, y, z) = 0$ (like a cone or quadric).","suggestion":"Use the geometric condition that the shortest vector from the origin to the surface, $\\vec{OP} = (x, y, z)$, must be parallel to the surface normal vector $\\nabla F$ at the point $P$, leading to the system of equations: $x = \\lambda \\frac{\\partial F}{\\partial x}$, $y = \\lambda \\frac{\\partial F}{\\partial y}$, $z = \\lambda \\frac{\\partial F}{\\partial z}$, and $F(x, y, z) = 0$."},{"situation":"When dealing with a cone defined by $x^2 + y^2 = k^2(z-z_v)^2$ and seeking the closest point to the origin.","suggestion":"Substitute the proportionality condition derived from the gradient method ($z - z_v = -z/k^2$) into the cone equation to solve for the $z$-coordinate of the closest point, $z_0$, before calculating the squared distance $r^2 = x^2+y^2+z^2$."},{"situation":"When an algebraic expression for a squared distance $r^2$ simplifies to a fraction involving a large prime number $p$ in the denominator, $r^2 = \\frac{A}{p^2}$, and subsequent algebraic steps reveal a factor of $p$ in the numerator.","suggestion":"Perform prime factorization on the numerator $A$ to check if it contains the prime factor $p$ from the denominator, allowing for cancellation that simplifies the final fraction to the form $m/p$ or $m/1$."}],"2020-II-9":[{"situation":"When counting arrangements (permutations) subject to multiple forbidden adjacent pairs (e.g., A cannot be next to B, B cannot be next to C).","suggestion":"Apply the Principle of Inclusion-Exclusion (PIE). Define the properties $P_i$ as the condition that the $i$-th forbidden adjacency occurs. Systematically calculate $S_k$, the sum of the counts of arrangements satisfying exactly $k$ properties, by grouping the constrained elements into rigid blocks and permuting these blocks."},{"situation":"When calculating the term $S_k$ in a PIE problem where the $k$ chosen constraints form various connected structures (e.g., chains or isolated pairs).","suggestion":"Classify the set of $k$ chosen constraints based on the resulting structure of the required blocks (e.g., a chain of length $m$ requires a block of $m+1$ elements). For a structure requiring $j$ disjoint blocks, if there are $k$ total constraints, the number of ways to arrange the $n$ items is $2^k \\times (n-k)!$ if the constraints are independent, or requires careful counting of permutations of the blocks and remaining single elements."},{"situation":"When a set of $m$ adjacency constraints forms a single contiguous chain (e.g., $A-B-C-D$ requires 3 adjacencies).","suggestion":"Treat the $m+1$ elements involved in the chain as a single rigid block. If the chain is fixed in one direction (e.g., $A$ must precede $B$), there is 1 internal ordering. If the chain allows reversal (e.g., $A$ next to $B$ and $B$ next to $C$ allows $A-B-C$ or $C-B-A$), multiply the block permutation count by 2."},{"situation":"When calculating the contribution $S_k$ where the $k$ chosen constraints result in multiple disjoint rigid blocks.","suggestion":"If the $k$ constraints result in $j$ disjoint blocks involving $m$ total elements, the number of arrangements is $2^k \\times (n - m + j)!$, where $n$ is the total number of elements. (This applies when the blocks are formed by non-overlapping constraints.)"}],"2020-II-10":[{"situation":"When an expression involving a sum of powers (like $\\sum k^3$) must satisfy a linear congruence modulo a term related to the index $n$ (e.g., $S_n \\equiv c \\pmod{n+a}$).","suggestion":"Multiply the entire congruence by the denominator of the closed-form formula (e.g., multiply by 4 if $S_n$ involves division by 4) to clear fractions, then use the substitution $n \\equiv -a \\pmod{n+a}$ to simplify the resulting polynomial congruence."},{"situation":"When the congruence derived after clearing fractions yields a condition $A \\equiv B \\pmod{D}$, but the original problem involved division by a factor $g = \\gcd(D, \\text{denominator})$ that was not coprime to $D$.","suggestion":"Use the derived condition $D \\mid (A-B)$ only to generate candidate values for $D$. For each candidate $D$, substitute $n = D-a$ back into the original, unmultiplied congruence $S_n \\equiv c \\pmod{D}$ and verify the remainder directly, as the multiplication step may have introduced extraneous solutions."},{"situation":"When analyzing divisors $D$ of a small composite number $C$ (e.g., $C=332 = 2^2 \\cdot 83$) where $D$ has factors that share common factors with the denominator of the formula being analyzed (e.g., $D$ is divisible by 2 or 4).","suggestion":"Separate the analysis into two cases: Case 1: $\\gcd(D, \\text{denominator}) = 1$, allowing direct modular reduction. Case 2: $\\gcd(D, \\text{denominator}) > 1$, requiring direct substitution and calculation of the actual remainder modulo $D$ for verification."},{"situation":"When finding integer solutions $n$ such that $n+5$ must divide a specific integer $C$ (e.g., $C=332$), and $n$ must be positive.","suggestion":"List all divisors $D$ of $C$. Filter the list by the constraint $D > 5$ (or $D > a$ if the modulus is $n+a$), then test the resulting finite set of candidates $n = D-5$ against the original problem statement."}],"2020-II-11":[{"situation":"When a set of three polynomials $P, Q, R$ share roots across their pairwise sums ($P+Q, P+R, Q+R$), leading to a structural assignment of roots to the sums.","suggestion":"Define the linear constraints implied by the shared roots (e.g., if $c_1$ is common to $P+Q$ and $P+R$, then $Q(c_1) = R(c_1)$) and use these constraints alongside Vieta's formulas derived from the sum polynomials."},{"situation":"When Vieta's sum formulas for three polynomials $P, Q, R$ (with roots $c_1, c_2, c_3$) are applied to the pairwise sums $S_{PQ}, S_{PR}, S_{QR}$.","suggestion":"Set up the system of three linear equations relating the coefficients of the sums to the sums of the roots ($c_1+c_2, c_1+c_3, c_2+c_3$). Look for linear combinations of these equations that isolate a single root or force a relationship between the coefficients."},{"situation":"When the product relations derived from Vieta's formulas (e.g., $c_i c_j = f(r_0, \\dots)$) must be consistent with linear constraints derived from the root structure.","suggestion":"Equate two different expressions for a constant term (like $r_0$) derived from different product relations, yielding a new constraint involving only the roots ($c_i, c_j, c_k$). Use this new constraint to substitute into the linear constraints to solve for the roots."},{"situation":"When solving a system involving both Vieta sum relations and constraints derived from the constant terms of the polynomials.","suggestion":"Isolate the sum and difference of two roots using the Vieta sum relations. Then, use the product relations combined with the linear constraints to derive an independent expression for the sum or difference of those same two roots, allowing for the determination of the roots via consistency checks."}],"2020-II-12":[{"situation":"When a geometric constraint (like intersection with a square) translates into a narrow, non-integer interval for an algebraic expression involving parameters (e.g., $A < f(m, n) < B$ where $B-A$ is small).","suggestion":"Isolate the expression $f(m, n)$ and determine its possible values based on the discrete constraints on the parameters. If the interval is narrow, check if any possible value falls within it, or if the structure of the parameters forces $f(m, n)$ to a specific, constant value (like an integer or a simple fraction)."},{"situation":"When parameters $m$ and $n$ are constrained by inequalities involving products or ratios of integers (e.g., $N_1 < mn \\le N_2$ and $N_3 < (m-1)n \\le N_4$).","suggestion":"Use the constraints to establish bounds on $m$ alone by eliminating $n$ (or vice versa). Since $m$ and $n$ are often restricted to be odd or even, test the few resulting integer possibilities for the variable with the tighter constraint."},{"situation":"When a set of valid discrete parameter pairs $(m, n)$ derived from initial constraints are tested against a final, more complex geometric condition, and it is found that all valid pairs force a specific, constant relationship between $m$ and $n$ (e.g., $r-1 = (m-1)/2$).","suggestion":"Substitute this constant relationship back into the original algebraic expression derived from the geometric condition. If the resulting constant value violates the required interval, conclude that zero solutions exist, confirming the result found by checking individual pairs."},{"situation":"When coordinates or geometric quantities are defined based on row/column indices $(r, c)$ in a grid structure, and the problem involves finding the intersection of a line segment defined by two boundary points.","suggestion":"Parameterize the line segment using a single variable (e.g., $t \\in [0, 1]$ or a ratio $X$) and express the coordinates $(x, y)$ as linear functions of this parameter. Use the known indices of the boundary points to determine the scaling factor relating the parameter to the index difference."}],"2020-II-13":[{"situation":"When calculating the inradius $r$ of a tangential polygon where the sum of the half-angles subtended at the incenter equals a simple multiple of $\\pi/2$ (e.g., $\\sum \\alpha_i = n\\pi/2$).","suggestion":"Use the tangent half-angle identity $\\tan(\\alpha_i) = r/x_i$, where $x_i$ are the tangent segment lengths. Group angles based on equal tangent lengths to simplify the sum relation $\\sum \\alpha_i = C$ into a single equation involving $\\tan(\\sum \\alpha_i)$ or $\\cot(\\sum \\alpha_i)$."},{"situation":"When the tangent segment lengths $x_i$ exhibit symmetry (e.g., $x_i = x_{n-i+1}$ or pairs of equal lengths) in a tangential polygon.","suggestion":"Group the corresponding half-angles ($\\alpha_i = \\alpha_j$) and use the double-angle or sum-of-angles formulas iteratively on the simplified angle sum to reduce the complexity before substituting the expressions for $\\tan(\\alpha_k)$ in terms of $r$."},{"situation":"When an algebraic path (like using the general tangent addition formula for many angles) leads to a high-degree polynomial equation (e.g., quartic) for the unknown variable $r$, and the expected answer format (like AIME integer answer) suggests a simpler root exists.","suggestion":"Re-examine the geometric constraints for symmetries or special angle values (like $45^\\circ$ or $90^\\circ$) that might simplify the trigonometric relation, potentially leading to a lower-degree polynomial or a direct solution for $r$."},{"situation":"When solving a trigonometric equation derived from angle sums that results in a quadratic equation for $r^2$ (or $R=r^2$), yielding two positive solutions.","suggestion":"Verify both solutions by substituting them back into the original geometric or trigonometric constraints (e.g., checking if the resulting angles sum correctly or if the resulting geometry is physically possible) to discard the extraneous root."}],"2020-II-14":[{"situation":"When solving an equation $f(f(\\dots f(x) \\dots)) = C$ where $f(x) = \\lfloor x \\rfloor \\{x\\}$ and the domain/range is bounded, requiring iterative inversion.","suggestion":"Work backward step-by-step, defining $x_i = f(x_{i+1})$. For each step $f(x_{i+1}) = x_i$, determine the possible range for $\\lfloor x_{i+1} \\rfloor = m'$ based on the known range of $x_i$ (i.e., $x_i < m'+1$). Systematically sum the number of valid integer parts $m'$ at each level."},{"situation":"When analyzing the constraint $f(y) = C$ where $y = m' + \\beta'$ and $C = m + \\beta$ (where $m=\\lfloor C \\rfloor$ and $\\beta=\\{C\\}$), and $y$ is the output of the previous step.","suggestion":"Use the definition $f(y) = m'\\beta' + (\\beta')^2 = C$. Since $m' = \\lfloor y \\rfloor$ and $\\beta' = \\{y\\}$, the constraint $\\beta' < 1$ translates to $C < m' + 1$. If $C$ is not an integer, this means $m' \\geq \\lfloor C \\rfloor$. If $C$ is an integer, $m' > C$ is required."},{"situation":"When the final step involves solving $k\\alpha + \\alpha^2 = z$ for $\\alpha \\in [0, 1)$ where $k$ is an integer determined by the previous steps, and the domain constraint $x=k+\\alpha \\leq X_{max}$ must be enforced.","suggestion":"Determine the maximum allowed integer part $k_{max} = \\lfloor X_{max} - \\alpha \\rfloor = X_{max}-1$ (if $X_{max}$ is an integer). For a fixed $z$, the number of solutions $k$ is the count of integers $k$ such that $k \\geq \\lceil z \\rceil$ and $k \\leq k_{max}$."},{"situation":"When the counting process results in a nested summation structure where the limits of the inner sum depend linearly on the index of the outer sum, leading to a sum of triangular numbers.","suggestion":"If the total count $N$ is $\\sum_{j=1}^{L} \\frac{j(j+1)}{2}$, use the identity for the sum of triangular numbers: $N = \\binom{L+2}{3}$. If the sum starts at $L=0$, the identity still holds for $L_{max}$ as $\\binom{L_{max}+2}{3}$."}],"2020-II-15":[{"situation":"When geometric constraints (like equal lengths from a point to vertices or the circumcenter) force two angles derived from different parts of the figure to be equal (e.g., $\\angle TBM = \\angle OBM$).","suggestion":"Set the trigonometric functions (sine or cosine) of the two angles equal to each other, use Pythagorean identities to relate the resulting variables (like $R$ and $OM$), and solve the resulting algebraic system to fix key parameters like the circumradius $R$ or the cosine of the main angle $A$."},{"situation":"When the side lengths $a, b, c$ of a triangle are related by the Law of Cosines, and you need to express $b^2+c^2$ in terms of $a$ and the product $bc$.","suggestion":"Use the Law of Cosines $a^2 = b^2 + c^2 - 2bc \\cos A$ to isolate $b^2+c^2 = a^2 + 2bc \\cos A$. If $\\cos A$ is known, this provides a linear relationship between $b^2+c^2$ and $bc$."},{"situation":"When the square of a segment length ($XY^2$) inside a triangle is expressed using the Law of Cosines involving two other segments ($TX, TY$) and the angle between them ($\\cos A$), and you are given a sum involving $TX^2+TY^2$ and $XY^2$.","suggestion":"Use the given sum ($S + XY^2 = K$) to express $2(TX)(TY) \\cos A$ in terms of $S$ and $K$. Then, express $S$ and $2(TX)(TY) \\cos A$ algebraically in terms of the side lengths ($b, c$) and the circumradius ($R$), and substitute known relationships (like the Law of Cosines for side $a$) to eliminate $b, c$ and solve for the required term."},{"situation":"When lengths in a triangle are expressed as ratios involving the circumradius $R$ (e.g., $TX = k \\cdot \\text{side length}/R$).","suggestion":"Substitute the expressions for the lengths into the derived algebraic equation involving $R^2$ and $bc$. Use the known value of $R^2$ to simplify the resulting expression, often leading to the cancellation of the unknown side lengths ($bc$) or the isolation of a constant multiple of $bc/R^2$ that can be related back to the known sum."}],"2021-I-1":[{"situation":"When the outcome of a sequence of trials depends only on the outcome of the immediately preceding trial (a Markov process) and the transition probabilities are constant.","suggestion":"Define the transition probabilities $p_{XY}$ (probability of moving from state X to state Y) based on the problem rules, and use these probabilities to calculate the probability of any specific sequence of states."},{"situation":"When calculating the probability of a sequence of $N$ trials in a two-state Markov chain, where the sequence must contain exactly $k$ transitions of one type (e.g., $X \\to Y$) and $N-k$ transitions of another type.","suggestion":"Identify the required number of transitions between each pair of states ($N_{XX}, N_{XY}, N_{YX}, N_{YY}$) based on the starting state, ending state, and the required number of state changes, then multiply the corresponding constant probabilities $p_{XX}, p_{XY}, \\dots$ raised to their respective counts."},{"situation":"When the required number of state changes ($k$) is small relative to the total number of trials ($N$), and the starting state is fixed.","suggestion":"Enumerate all possible positions where the required state change occurs (e.g., where the single loss occurs in the sequence of subsequent wins), calculate the probability for each case (which may involve different counts of $p_{Stay}$ vs $p_{Switch}$ transitions), and sum the results."},{"situation":"When the final answer must be a reduced fraction $m/n$ derived from a sum of probabilities involving powers of small prime denominators (e.g., $1/3$ and $2/3$).","suggestion":"Factor out the common denominator from the sum (e.g., $3^N$), simplify the resulting integer numerator and denominator, and then check for common factors between the final numerator and denominator before summing them."}],"2021-I-2":[{"situation":"When a geometric figure (like a rectangle) is defined by its diagonal length and the lengths of its sides, and its orientation relative to the coordinate axes is unknown.","suggestion":"Set up a coordinate system, use vector decomposition (or rotation matrices) based on the diagonal vector and the side lengths to determine the direction vectors (slopes) of the rectangle's sides relative to the diagonal."},{"situation":"When finding the area of an intersection between two axis-aligned shapes (like a rectangle defined by $0 \\le x \\le X, 0 \\le y \\le Y$) and a rotated shape (like a parallelogram or rectangle defined by four linear inequalities).","suggestion":"Determine the equations of the boundary lines of the rotated shape. Systematically test the intersection of these four lines with the four boundary lines of the axis-aligned shape ($x=0, x=X, y=0, y=Y$) to find the vertices of the resulting intersection polygon."},{"situation":"When the vertices of the resulting intersection polygon are found, and the polygon has two parallel sides lying on lines $y=y_1$ and $y=y_2$ (horizontal bases).","suggestion":"Identify the polygon as a trapezoid (or parallelogram). Calculate the lengths of the two parallel bases by finding the x-coordinates of the vertices on those lines, and use the standard trapezoid area formula: Area = (1/2) * (base1 + base2) * height."},{"situation":"When calculating the coordinates of points $E$ and $F$ that form a parallelogram $AECF$ on diagonal $AC$, where $AE \\perp AF$ and $AE, AF$ are known lengths.","suggestion":"Define $\\vec{AC} = \\vec{v}$. Decompose $\\vec{v}$ into components parallel to $\\vec{AE}$ and $\\vec{AF}$ using the known lengths and the fact that $\\vec{AE} \\cdot \\vec{AF} = 0$. Use the resulting scalar projection factors to determine the coordinates of $E$ and $F$ relative to $A$ and $C$."}],"2021-I-3":[{"situation":"When an integer $N$ is defined as the difference of two powers of the same base, $N = B^a - B^b$ with $a > b$.","suggestion":"Factor out the smaller power: $N = B^b (B^{a-b} - 1)$. If $B$ is even (like $B=2$), this factorization separates $N$ uniquely into its power-of-the-base factor ($B^b$) and its odd factor ($B^{a-b} - 1$). Use this unique representation to count possibilities."},{"situation":"When counting the number of non-negative integers $b$ that satisfy an inequality involving powers of 2, such as $2^b < C$.","suggestion":"The number of solutions is $\\lfloor \\log_2(C) \\rfloor + 1$. If $C$ is not an integer, use the floor function on the result of the logarithm."},{"situation":"When iterating through a parameter $k$ (derived from $a-b$) and finding that the maximum possible value for $k$ is constrained by a fixed upper bound on $N$ (e.g., $N < 1000$).","suggestion":"Determine the maximum $k_{max}$ such that the smallest possible corresponding $N$ (which occurs when $b=0$) still satisfies the constraint. Then, iterate $k$ from 1 up to $k_{max}$ and sum the counts for each $k$."}],"2021-I-4":[{"situation":"When counting the number of integer solutions $(n_1, n_2, \\dots, n_k)$ to a fixed sum $N$ subject to strict inequalities $1 \\le n_1 < n_2 < \\dots < n_k$.","suggestion":"Establish the tightest lower bound for the smallest variable ($n_1$) by substituting the minimum possible increments ($n_i \\ge n_1 + i - 1$), then iterate over the possible values of $n_1$ and calculate the number of remaining solutions for the subsequent variables based on the reduced sum and remaining constraints."},{"situation":"When the number of solutions for the remaining variables ($n_2, \\dots, n_k$) depends on a fixed variable ($n_1$) via floor functions involving parity-dependent terms (e.g., $\\lfloor (C - n_1)/2 \\rfloor$).","suggestion":"Separate the summation over $n_1$ into two cases based on the parity of $n_1$ (e.g., $n_1 = 2k-1$ and $n_1 = 2k$). For each case, simplify the expression for the count function $L(n_1)$ into a linear function of the index variable ($k$), allowing the total count to be found by summing two standard arithmetic progressions."},{"situation":"When a counting problem involving distinct parts can be mapped to a partition problem involving non-distinct parts (e.g., $n_1 < n_2 < n_3$ maps to $x_1 \\ge 0, x_2 \\ge 0, x_3 \\ge 0$ via a transformation).","suggestion":"Apply the transformation $n_i = x_i + i - 1$ (or similar substitution based on the number of parts) to convert the strict inequality sum into a simpler linear Diophantine equation, and verify the resulting count against the direct summation method."}],"2021-I-5":[{"situation":"When solving for an integer variable $a$ in a quadratic equation $Ax^2 + Bx + C = 0$ where the coefficients $B$ and $C$ depend on another integer parameter $d$ (e.g., $3a^2 - d^2 a + 2d^2 = 0$).","suggestion":"Set the discriminant $\\Delta$ equal to a perfect square, $k^2$. If $\\Delta$ factors nicely (e.g., $\\Delta = d^2 (d^2 - C')$), reduce the problem to finding integer solutions for the remaining factor being a perfect square ($d^2 - C' = m^2$). This transforms the problem into a difference of squares Diophantine equation ($d^2 - m^2 = C'$)."},{"situation":"When a Diophantine equation is reduced to the form $X^2 - Y^2 = N$ (difference of squares).","suggestion":"Factor the left side as $(X-Y)(X+Y) = N$. Systematically list all pairs of factors $(f_1, f_2)$ of $N$ such that $f_1 f_2 = N$. Solve the resulting linear system $X-Y=f_1$ and $X+Y=f_2$ for $X$ and $Y$, ensuring that $f_1$ and $f_2$ have the same parity (both even if $N$ is divisible by 4, both odd if $N$ is odd) to guarantee integer solutions."},{"situation":"After finding integer solutions for a parameter $d$ (the common difference) in an arithmetic sequence, and subsequently finding the middle term $a$ using the quadratic formula $a = (-B \\pm k) / (2A)$.","suggestion":"For each valid $d$, substitute the corresponding discriminant square root $k$ back into the formula for $a$. Explicitly check the divisibility condition (e.g., check if $d^2 \\pm k$ is divisible by $2A$) to ensure $a$ is an integer, discarding non-integer roots."}],"2021-I-6":[{"situation":"When distances from an interior point P to vertices of a rectangular prism (or cube) are given, and the distances to two opposite vertices are related to the distances to the three vertices adjacent to one of them.","suggestion":"Place one vertex (A) at the origin (0,0,0) and the edges along the axes. Express the squared distances $AP^2, BP^2, CP^2, DP^2$ using coordinates $(x,y,z)$ and side length $s$. Systematically combine the equations for the adjacent vertices ($B, C, D$) to isolate the sum $2s(x+y+z)$ in terms of $s^2$ and $AP^2$."},{"situation":"When the expression for the distance to the opposite vertex ($GP^2$) involves the same linear combination of coordinates ($x+y+z$) that was isolated in the previous step.","suggestion":"Substitute the derived expression for $2s(x+y+z)$ into the expanded equation for $GP^2$. Look for algebraic cancellation, specifically expecting terms involving the unknown side length ($s^2$) to eliminate, resulting in a solvable equation for the required distance squared ($AP^2$)."},{"situation":"When solving a system of linear equations derived from squared distances in 3D space yields a relationship between the unknown side length $s$ and the known distances.","suggestion":"Ensure that the structure of the problem (e.g., using distances to vertices $A, B, C, D, G$ in a cube) guarantees that the terms involving $s$ will cancel when combining the equations for the vertex opposite $A$ with the sum of the equations for the vertices adjacent to $A$."}],"2021-I-7":[{"situation":"When the existence of a solution $x$ requires two simultaneous trigonometric conditions, such as $\\sin(mx)=1$ and $\\sin(nx)=1$, leading to a Diophantine equation involving specific linear forms (e.g., $n(1+4k_1) = m(1+4k_2)$).","suggestion":"Use the GCD decomposition $m=da, n=db$ ($\\gcd(a, b)=1$) to simplify the resulting linear equation. Analyze the constraints on the coprime factors $a$ and $b$ modulo the relevant constant (here, 4) to find the necessary and sufficient condition relating $m$ and $n$."},{"situation":"When the derived necessary and sufficient condition for a pair $(m, n)$ depends on the powers of a specific prime dividing $m$ and $n$ (e.g., $v_2(m) = v_2(n)$) and the residue of the remaining factors modulo that prime's exponent plus one (e.g., $m' \\equiv n' \\pmod 4$).","suggestion":"Partition the set of possible integers $\\{1, \\dots, N\\}$ into disjoint subsets based on the common exponent $e$ and the residue $r$ of the odd part. For each subset $S_{e, r}$, count the number of elements $|S_{e, r}|$. The total number of valid pairs $(m, n)$ with $m < n$ is the sum of $\\binom{|S_{e, r}|}{2}$ over all relevant $(e, r)$ combinations."},{"situation":"When counting pairs $(m, n)$ such that $m < n \\le N$ and $m, n$ must share the same $v_p(k)$ value and satisfy a congruence relation on their $p$-free parts.","suggestion":"Iterate through all possible exponents $e = v_p(k)$ such that $p^e \\le N$. For each $e$, determine the set of integers $k$ whose $p$-free part $k'$ satisfies the required congruence modulo $p^{v+1}$. Then, use binomial coefficients to count the pairs within each resulting equivalence class."}],"2021-I-8":[{"situation":"When solving an equation involving nested absolute values, such as ||f(x)| - a| = b, where f(x) is an even function.","suggestion":"Decompose the equation into two separate equations based on the outermost absolute value: |f(x)| = a + b and |f(x)| = a - b. Then, exploit the even symmetry by analyzing the solutions only for x >= 0, remembering that non-zero positive solutions yield pairs of solutions (x, -x)."},{"situation":"When counting the number of solutions to an equation of the form |g(x)| = K, where g(x) is a simple polynomial (like a parabola) defined on x >= 0.","suggestion":"Graph the function g(x) for x >= 0, identifying its local extrema and intercepts. Use the values of K relative to these critical points (e.g., K below the maximum, K equal to the maximum, K above the maximum) to determine the number of positive solutions, N+(K)."},{"situation":"When the total number of solutions must be an even number, and the function being solved against is even, but the solution set includes x=0.","suggestion":"Verify that x=0 is not a solution (i.e., check that the constants K1 and K2 are strictly positive). If x=0 is a solution, the total count T = 2 * (positive solutions) + 1, which means T must be odd. If the required count is even, immediately discard cases where K1=0 or K2=0."},{"situation":"When the required total number of positive solutions (N_total) must be achieved by summing the solutions from two separate equations, N_total = N+(K1) + N+(K2), where K1 and K2 are linearly related (e.g., K1 = K2 + constant).","suggestion":"List all possible values for N+(K) based on the shape of the underlying graph (e.g., {1, 2, 3} for a single hump). Systematically check combinations of these values that sum to N_total, and use the relationship between K1 and K2 to constrain the required ranges for K1 and K2."}],"2021-I-9":[{"situation":"When solving a geometry problem involving distances from a vertex to diagonals and sides of a trapezoid, leading to a system involving sums ($S=b_1+b_2$) and differences ($s=b_2-b_1$) of the parallel bases.","suggestion":"Express all geometric constraints (like area $K=hS/2$ or distance formulas) in terms of $S$, $s$, and the height $h$. Use the relationship $b_1 = (S-s)/2$ and $b_2 = (S+s)/2$ to convert equations involving $b_1$ and $b_2$ into equations involving only $S$ and $s$."},{"situation":"When the height ($h$) and the distance from a vertex to a non-parallel side ($d_{side}$) are known in an isosceles trapezoid, and the bases are $b_1, b_2$ with $s=b_2-b_1$.","suggestion":"Apply the geometric relationship derived from similar triangles formed by dropping altitudes: $d_{side} = h \\cdot (s/2) / (\\text{leg length})$. Use this to find a fixed value for $s^2$ independent of the bases' sum $S$."},{"situation":"When the distance ($d_{diag}$) from the same vertex to a diagonal is known, leading to an equation involving $S^2$ and $d_{diag}$.","suggestion":"Use the Pythagorean theorem on the triangle formed by the height, the projection of the diagonal onto the base, and the diagonal itself. If $b_1$ is the projection of the diagonal onto the lower base, the relationship $h b_1 = d_{diag} \\cdot (\\text{diagonal})$ often simplifies to a quadratic relation between $S^2$ and $b_1^2$ (or $S^2$ and $s^2$ after substitution)."},{"situation":"When combining two derived constraints (one involving $s^2$ explicitly, the other involving $S^2$ and $Ss$) results in a complex quadratic equation for $S$ (or $S^2$) whose discriminant appears non-square, suggesting an intended integer solution was missed.","suggestion":"Test specific simple integer values for $S$ (or $L$, where $L^2$ relates to the diagonal length) that simplify the Pythagorean relationship derived from the diagonal distance. If a simple integer $S$ yields a value for $s^2$ that is close to, but not exactly, the value derived from the side distance constraint, re-verify the geometric formula used for the side distance constraint, as it might depend on a subtle configuration detail."}],"2021-I-10":[{"situation":"When analyzing a recurrence relation $d_{k+1} = f(d_k, g_{k+1})$ where $g_{k+1}$ is a GCD involving linear functions of the sequence terms $m_k, n_k$, and the goal is to find $k$ such that $d_k=1$.","suggestion":"Iteratively compute the first few terms, looking for patterns where $d_k$ follows a simple arithmetic progression $d_k = k-C$, and use this pattern to simplify the GCD term $g_{k+1}$ into a constant divisor $K$ or a simple function of $k$."},{"situation":"When the structure of the recurrence implies that a solution $d_{k+1}=1$ occurs if and only if $d_k+1$ divides a constant $K$ (derived from the simplified GCD).","suggestion":"If $d_k = k-C$, the condition becomes $k-C+1$ must divide $K$. Systematically check all divisors of $K$ for $k-C+1$ to find all solutions within that phase."},{"situation":"When the iterative process leads to a sequence of solutions that appears infinite because the structure stabilizes, resulting in the condition $d_k+1$ dividing a small constant (like 1 or 19) for many subsequent steps.","suggestion":"If the problem asks for a finite sum, assume the intended solutions are those generated during the initial phases where the structure was complex and the divisor $K$ was derived from the initial parameters, rather than the stabilized, infinite-solution phases."},{"situation":"When a solution $d_{k+1}=1$ is found because $d_k+1$ divides $m_k+18$ exactly, and the next phase begins with $d_{k+1}=1$ (i.e., $d_k+1 = g_{k+1}$).","suggestion":"Define the new phase by $d_k = k-C'$, and re-derive the expression for $m_k$ based on the assumption that $g_i=1$ for all steps within the new phase, leading to a new constant $K'$ for the next set of solutions."}],"2021-I-11":[{"situation":"When the side lengths of a derived polygon (e.g., formed by projections or midpoints) are related linearly to the side lengths of an original figure, especially one defined by diagonals intersecting at an angle $\\theta$.","suggestion":"Hypothesize a relationship of the form $S_{new} = S_{old} |\\cos \\theta|$ or $S_{new} = S_{old} |\\sin \\theta|$, and use coordinate geometry or the Law of Cosines on the relevant small triangles formed by the intersection point to prove the scaling factor."},{"situation":"When dealing with a cyclic quadrilateral where all four side lengths are known, and the goal is to find properties related to its diagonals ($p, q$) or the angle ($\\theta$) between them.","suggestion":"Apply Brahmagupta's formula to find the area $K$, apply Ptolemy's theorem ($pq = ac+bd$) to find the product of the diagonals, and use the area formula $K = \\frac{1}{2} pq \\sin \\theta$ to determine $\\sin \\theta$."},{"situation":"When the angle $\\theta$ between the diagonals of a cyclic quadrilateral is needed, and $\\sin \\theta$ has been found using area formulas.","suggestion":"Calculate $\\cos^2 \\theta$ using the identity $\\cos^2 \\theta = 1 - \\sin^2 \\theta$, simplify the resulting fraction, and take the square root to find $|\\cos \\theta|$."},{"situation":"When the perimeter of a derived figure is a simple multiple of a known sum (like the perimeter of the original figure) scaled by a trigonometric factor.","suggestion":"Calculate the scaling factor $|\\cos \\theta|$ or $|\\sin \\theta|$ exactly, substitute it back into the perimeter expression $P = S \\cdot (\\text{factor})$, and ensure the resulting fraction is reduced to find $m$ and $n$ for the final sum $m+n$."}],"2021-I-12":[{"situation":"When analyzing the expected time until a system reaches an absorbing state, where the system's state is defined by relative distances or differences between components (e.g., positions of three objects).","suggestion":"Define the state space based on the set of relative distances modulo the cycle length (e.g., 12). Group states into orbits that are symmetric under permutation of the components, and set up a system of linear equations for the expected hitting time $E_i$ within each orbit $i$ using the formula $E_i = 1 + \\sum_j P_{i \\to j} E_j + P_{i \\to \\text{Absorb}} \\cdot 0$."},{"situation":"When the evolution of a system depends on the simultaneous, independent actions of several discrete agents (e.g., three frogs moving $\\pm 1$ or $0$).","suggestion":"Model the transition probabilities $P_{i \\to j}$ by enumerating all $2^k$ (or $3^k$) equally likely outcomes of the individual agent movements, and use these outcomes to determine the probability of transitioning between the defined state orbits."},{"situation":"When the state space of relative differences is restricted to even numbers (or numbers divisible by some factor $d$) due to an even initial configuration.","suggestion":"Reduce the state space by considering only the relevant subset of differences (e.g., $\\{2, 4, 6, 8, 10\\}$ instead of $\\{0, 1, \\dots, 11\\}$) and verify that all reachable states belong to this reduced set, simplifying the system of equations."},{"situation":"When solving a system of linear equations derived from expected hitting times, where the resulting fraction $m/n$ is expected to be irreducible.","suggestion":"After finding the solution $E_1 = m/n$, verify that $\\gcd(m, n) = 1$ by checking if the denominator $n$ divides the determinant of the coefficient matrix, or by explicitly checking common factors."}],"2021-I-13":[{"situation":"When a chord of a circle $\\omega$ (center $O$, radius $r$) subtends a known central angle $\\theta$ (e.g., $120^\\circ$), and the distance from $O$ to the line containing the chord is required.","suggestion":"Use the isosceles triangle formed by the center and the chord endpoints. The distance $h$ from the center to the chord is $h = r \\cos(\\theta/2)$."},{"situation":"When two circles $\\omega_1$ (radius $r_1$) and $\\omega_2$ (radius $r_2$) are externally tangent to a third circle $\\omega$ (radius $r$), and their centers $O_1, O_2, O$ are considered.","suggestion":"Set up the distance constraints $OO_1 = r+r_1$ and $OO_2 = r+r_2$. If the centers $O_1, O_2, O$ are collinear, use the triangle inequality/sum of segments. If they form a triangle, use the Law of Cosines or coordinate geometry on $\\triangle OO_1O_2$."},{"situation":"When the radical axis (the line defined by equal power with respect to two circles) is involved, and the centers $O_1, O_2$ lie on the x-axis.","suggestion":"Define the radical axis as a vertical line $x=x_0$. Derive the equation for $x_0$ by subtracting the standard circle equations, which yields a linear relationship between $x_0$ and the radii squared."},{"situation":"When a geometric configuration involves the center $O$ of a circle, the centers $O_1, O_2$ of two other circles, and the radical axis $L$ of the latter two, where $L$ is perpendicular to $O_1O_2$.","suggestion":"Set up a coordinate system where $O_1O_2$ is the x-axis and $L$ is the line $x=x_0$. Express the position of $O=(x_O, y_O)$ relative to $O_1$ and $O_2$ using the tangency conditions, and then relate $x_O$ to $x_0$ by eliminating the unknown coordinates defining $O_1$ and $O_2$'s positions relative to the origin."}],"2021-I-14":[{"situation":"A condition must hold for all integers $a$ modulo a composite number $M$, where $M$ is factored into coprime moduli $m_i$ (i.e., $M = \\prod m_i$).","suggestion":"Decompose the problem by requiring the condition to hold modulo each $m_i$ independently, and then find the least common multiple (LCM) of the required exponents or parameters derived from each modulus."},{"situation":"When analyzing the multiplicative function $\\sigma(x)$ (sum of divisors) modulo a prime $p$, especially when the argument $x$ is a prime power $q^k$ where $q \\ne p$.","suggestion":"Use the formula $\\sigma(q^k) = \\frac{q^{k+1}-1}{q-1}$. If the condition is $\\sigma(q^k) \\equiv 1 \\pmod{p}$, simplify this to $q^{k+1} \\equiv q \\pmod{p}$, which reduces to $q^k \\equiv 1 \\pmod{p}$."},{"situation":"When a parameter $n$ must satisfy $p^n \\equiv 1 \\pmod{m}$ for all bases $p$ coprime to $m$.","suggestion":"Determine the required value of $n$ by finding the least common multiple of the orders of all elements in the multiplicative group $(\\mathbb{Z}/m\\mathbb{Z})^\\times$, which is equivalent to finding the exponent of the group, $\\lambda(m)$, or $\\phi(m)$ if $m$ is prime."},{"situation":"When a condition involving the multiplicative function $\\sigma$ must hold for all integers $a$, and the required exponent $n$ has been found based on prime powers $p^n$.","suggestion":"Verify that the derived $n$ is sufficient for composite bases $a = \\prod p_i^{e_i}$ by using the multiplicative property $\\sigma(a^n) = \\prod \\sigma(p_i^{ne_i})$ and confirming that each factor $\\sigma(p_i^{ne_i})$ satisfies the required congruence modulo $m$."}],"2021-I-15":[{"situation":"When the intersection points of two algebraic curves (e.g., two conics) are required to lie on a third, simpler curve (like a circle or line).","suggestion":"Use linear combinations of the defining equations of the two given curves to eliminate the highest-degree terms (e.g., $x^2$ and $y^2$ terms) or to force the resulting equation into the standard form of the desired third curve."},{"situation":"When a geometric constraint (like the maximum radius of a derived circle) limits the possible values of a parameter $k$ to a finite range of integers.","suggestion":"Calculate the maximum/minimum value allowed by the constraint, solve the resulting inequality for $k$, and identify the set $S$ of all positive integers satisfying the bound. Assume this set $S$ satisfies any other existence conditions unless a simple counterexample is found."},{"situation":"When analyzing the number of real roots of a high-degree polynomial $P(x)$ derived from substituting one curve equation into another, and the analysis suggests fewer roots than expected based on the problem context.","suggestion":"If the derived range of parameters $k$ is finite and non-empty based on simpler constraints (like radius bounds), verify the existence condition using the simplest possible parameter values (e.g., $k=1$) to check for immediate contradictions before concluding the set is empty."},{"situation":"When the problem asks for the sum of the minimum and maximum values of an integer parameter $k$ that satisfies a derived range constraint $k_{min} \\le k \\le k_{max}$.","suggestion":"Identify $k_{min}$ as the smallest positive integer satisfying the lower bound and $k_{max}$ as the largest integer satisfying the upper bound, and calculate their sum directly."}],"2021-II-1":[{"situation":"When calculating the sum or average of a set of numbers defined by independent choices over two or more variables (e.g., $P = c_1 X + c_2 Y$ where $X$ and $Y$ are chosen independently from finite sets).","suggestion":"Use the linearity of expectation (or the average property): $\\text{Mean}(P) = c_1 \\cdot \\text{Mean}(X) + c_2 \\cdot \\text{Mean}(Y)$. Calculate the mean of each variable set separately."},{"situation":"When the structure of the numbers being averaged involves coefficients that are powers of 10 and the digits are constrained to be consecutive integers starting from 0 or 1.","suggestion":"Calculate the mean of the set $\\{1, 2, \\dots, k\\}$ as $(k+1)/2$ and the mean of the set $\\{0, 1, \\dots, k\\}$ as $k/2$, and substitute these into the linear expression."},{"situation":"When a summation involves iterating over all combinations of two independent sets of indices, $i \\in I$ and $j \\in J$, and the summand can be factored or separated.","suggestion":"Decompose the total sum $S = \\sum_{i \\in I} \\sum_{j \\in J} f(i, j)$ into $\\sum_{i \\in I} (\\text{Count}(J) \\cdot \\text{Term involving } i) + \\sum_{j \\in J} (\\text{Count}(I) \\cdot \\text{Term involving } j)$ to simplify the calculation."}],"2021-II-2":[{"situation":"When a geometric configuration involves a large figure (like an equilateral triangle) being cut by a line parallel to one of its sides, creating a smaller, similar figure near the opposite vertex.","suggestion":"Define the similarity ratio $k$ between the smaller figure and the original. Express key lengths (like altitudes or side lengths) of the smaller figure as $k$ times the corresponding lengths of the original figure, and use this ratio to relate heights and base positions."},{"situation":"When calculating the area of a right triangle whose legs are determined by coordinates derived from a horizontal line intersecting a line segment defined by a slope of $\\pm \\sqrt{3}$ (implying 60-degree angles).","suggestion":"If the height of the horizontal line is $h$, the horizontal projection (the other leg) will be $h/\\sqrt{3}$. Calculate the area using $\\frac{1}{2} \\cdot h \\cdot (h/\\sqrt{3})$."},{"situation":"When the ratio of the areas of two triangles is known, and both areas are expressed cleanly in terms of a single unknown similarity ratio $k$ and a common side length $s$ (e.g., Area $\\propto k^2 s^2$ and Area $\\propto (1-k)^2 s^2$).","suggestion":"Form the ratio of the area expressions, cancel common factors ($s^2$ and constants), and solve the resulting simple algebraic equation for $k$ by taking the square root of both sides."},{"situation":"When analyzing an isosceles triangle $\\triangle PQR$ where two vertices ($P, Q$) are fixed relative to a coordinate system, and the third vertex ($R$) lies on a line segment $L$ connecting two other points ($S, T$), and the isosceles condition must hold ($PR=QR$ or $PQ=PR$ or $PQ=QR$).","suggestion":"Set up the squared distance equations ($d^2 = \\Delta x^2 + \\Delta y^2$) for the relevant sides. If the line $L$ is horizontal or vertical, use the fixed coordinate to simplify the equations, leading to a quadratic or linear equation in the coordinates of $R$ that must be solved simultaneously with the line equation."}],"2021-II-3":[{"situation":"When analyzing a cyclic sum or expression involving variables $x_1, \\dots, x_n$ where the condition depends only on the residues modulo $m$ (e.g., $m=3$).","suggestion":"Determine the exact multiset of residues $\\{x_1 \\pmod m, \\dots, x_n \\pmod m\\}$ and exploit the cyclic symmetry of the expression by fixing one variable's residue (e.g., $x_k \\equiv 0 \\pmod m$) and multiplying the resulting count by $n$ if the structure is fully symmetric."},{"situation":"When the required condition on the sum of products modulo $m$ simplifies significantly because one residue is 0 (i.e., $x_k \\equiv 0 \\pmod m$).","suggestion":"Substitute $x_k \\equiv 0 \\pmod m$ into the cyclic sum, cancel terms, and analyze the resulting simplified condition on the remaining residues, often leading to a requirement that the sum or product of two specific residues must be $0 \\pmod m$."},{"situation":"When counting assignments of distinct numbers to positions based on their residues, where the available numbers are partitioned into sets $A_r$ based on $x \\equiv r \\pmod m$.","suggestion":"Once a valid residue pattern $(r_1, \\dots, r_n)$ is found, calculate the number of ways to assign the actual numbers by multiplying the factorials of the counts of positions assigned to each residue $r$, i.e., $\\prod_r (\\text{count of } r)! \\times \\prod_{r} (|A_r|! / (|A_r| - \\text{count of } r)!)$ if the sets $A_r$ are distinct."},{"situation":"When a necessary condition derived from modular arithmetic (e.g., $r_a + r_b \\equiv 0 \\pmod 3$) involves residues restricted to a small set (like $\\{1, 2\\}$).","suggestion":"Enumerate the few possible pairs $(r_a, r_b)$ that satisfy the condition, determine the required residues for the remaining variables based on the initial multiset constraint, and count the resulting valid residue patterns."}],"2021-II-4":[{"situation":"A polynomial with real coefficients has a known real root and a shared complex root $z = m + i\\sqrt{n}$ (where $m, n$ are integers).","suggestion":"Immediately invoke the Conjugate Root Theorem: $\\bar{z}$ must also be a root. Use Vieta's formulas, focusing first on the coefficient of the second-highest power (which relates to the sum of roots) to solve for $m$."},{"situation":"A polynomial $P(x) = x^k + a_{k-2}x^{k-2} + \\dots + a_0$ is missing the $x^{k-1}$ term (i.e., the sum of roots is zero).","suggestion":"Set the sum of the known roots (including the complex conjugate pair $z$ and $\\bar{z}$) equal to zero to establish a linear relationship between the real part of the complex root and the known real roots."},{"situation":"Two polynomials $P(x)$ and $Q(x)$ share a pair of complex conjugate roots $z, \\bar{z}$, and the coefficients of the intermediate terms ($x^{k-2}$ in $P$ and $x$ in $Q$) are known to be zero.","suggestion":"Apply Vieta's formulas for the sum of products of roots taken two at a time to the polynomial whose intermediate coefficient is zero. This will yield an equation involving $m^2+n$ (the product $z\\bar{z}$) and the known real roots, allowing you to solve for $n$ once $m$ is known."},{"situation":"When solving for unknown parameters ($m, n$) using Vieta's formulas across multiple related polynomials.","suggestion":"Systematically check that the derived values for $m$ and $n$ are consistent with the constraints given in the problem (e.g., $m, n$ must be positive integers) and that they satisfy the equations derived from *all* available coefficients (not just the ones used to solve for $m$ and $n$)."}],"2021-II-5":[{"situation":"When a geometric configuration (like a triangle) is defined by two fixed sides and the area $s$ is determined by the included angle $\\theta$, leading to $s = K \\sin \\theta$.","suggestion":"Recognize that for a fixed area $s < K$, there are two possible angles, $\\theta_1$ (acute) and $\\theta_2 = 180^\\circ - \\theta_1$ (obtuse), which generate two distinct triangles $T_1$ and $T_2$ (unless $s=K$, yielding a right triangle)."},{"situation":"When determining the nature (acute, right, obtuse) of the angles in a triangle defined by the Law of Cosines, where the side lengths depend on a parameter $z$ derived from the area $s$ via $\\cos \\theta$.","suggestion":"Use the Law of Cosines to express the square of the third side ($z^2$) in terms of the known sides and $\\cos \\theta$. Then, determine the condition on $s$ (or $\\cos \\theta$) that makes the angle opposite one of the fixed sides obtuse (i.e., $z^2 < (\\text{fixed side})^2$)."},{"situation":"When a set of possible geometric objects $S$ is characterized by a parameter $s$, and the requirement is that a specific subset $\\tau(s) \\subset S$ must satisfy two conditions: (1) $\\tau(s)$ is non-empty, and (2) all elements in $\\tau(s)$ are congruent.","suggestion":"Analyze the conditions separately. If the objects come in non-congruent pairs ($T_1, T_2$), the congruence requirement forces $|\\tau(s)|=1$. Determine the parameter range where exactly one object satisfies the required property (e.g., being obtuse)."},{"situation":"When the derived set of valid parameters $S$ is an open-closed interval, such as $(c, d]$, and the problem requires expressing the bounds in the form $[a, b)$.","suggestion":"Set the lower bound $a$ to the infimum of $S$ (which may be 0 if the parameter can be arbitrarily small) and set the upper bound $b$ to the supremum of $S$ (which must be the largest value satisfying the condition)."}],"2021-II-6":[{"situation":"When an algebraic identity involving set cardinalities simplifies to a product of differences being zero (e.g., $|A||B| = |A \\cap B||A \\cup B|$).","suggestion":"Rewrite the identity in terms of the sizes of the disjoint set differences ($|A \\setminus B|$ and $|B \\setminus A|$), which reveals the condition must be one set being a subset of the other ($A \\subseteq B$ or $B \\subseteq A$)."},{"situation":"When the required counting condition is the union of two subset relationships, $P \\text{ or } Q$ (e.g., $A \\subseteq B$ or $B \\subseteq A$).","suggestion":"Apply the Principle of Inclusion-Exclusion: Count the cases satisfying $P$, count the cases satisfying $Q$, and subtract the cases satisfying both $P \\text{ and } Q$ (which is $P \\cap Q$)."},{"situation":"When counting the number of pairs of subsets $(A, B)$ of a ground set $S$ such that one is contained in the other ($A \\subseteq B$ or $B \\subseteq A$).","suggestion":"For the condition $A \\subseteq B$, analyze the placement of each element $x \\in S$ into one of three mutually exclusive categories: ($x \\in A$ and $x \\in B$), ($x \\notin A$ and $x \\in B$), or ($x \\notin A$ and $x \\notin B$). Use the multiplication principle based on the number of categories ($3^{|S|}$)."},{"situation":"When calculating the intersection case for the PIE involving subset relations ($A \\subseteq B$ and $B \\subseteq A$).","suggestion":"Recognize that the intersection $A \\subseteq B \\cap B \\subseteq A$ is equivalent to $A=B$. Count the number of pairs where $A=B$ by counting the total number of subsets ($2^{|S|}$), as $A$ can be any subset of $S$ and $B$ is fixed to be equal to $A$."}],"2021-II-7":[{"situation":"When a system of polynomial equations derived from symmetric sums ($e_k$) leads to a contradiction (e.g., no real solutions when real solutions are required, or an irrational result when a rational answer is expected).","suggestion":"Hypothesize the most structurally plausible typo in the original constraints that resolves the contradiction while maintaining the overall algebraic structure (e.g., swapping a term, changing a sign, or altering a coefficient based on expected symmetry properties) and solve the revised system."},{"situation":"When analyzing the reality of roots for a quadratic equation $t^2 - S t + P = 0$ derived from a pair of variables (like $a, b$ or $c, d$), where $S$ is the sum and $P$ is the product.","suggestion":"Verify the discriminant condition $S^2 \\ge 4P$. If the derived value violates this condition (e.g., $S^2 < 4P$ when real roots are required), reject that solution branch and use the alternative root of the preceding quadratic equation (e.g., the one for $X$ or $Y$) that satisfies the reality constraint."},{"situation":"When the problem involves elementary symmetric polynomials $e_1, e_2, e_3, e_4$ of four variables, and the equations provided relate to specific cross-products (like $ab+bc+ca$ or $a+b+c$).","suggestion":"Decompose the variables into two pairs, say $\\{a, b\\}$ and $\\{c, d\\}$, define their sums $S_{ab}, S_{cd}$ and products $P_{ab}, P_{cd}$, and rewrite the given constraints in terms of these pair sums/products and the cross-terms $S_{ab}S_{cd}$ and $P_{ab}+P_{cd}$ to isolate relationships between the pair sums."},{"situation":"When the target quantity is the sum of squares, $S = \\sum a_i^2$, and the elementary symmetric polynomials $e_1$ and $e_2$ are known or derivable.","suggestion":"Apply Newton's sums identity $S = e_1^2 - 2e_2$ directly, ensuring that $e_1$ and $e_2$ are calculated based on the full set of variables."}],"2021-II-8":[{"situation":"When the state of a system at time k depends linearly on the state at time k-1, especially in probability problems involving movement between a small, fixed number of states (e.g., vertices of a cube or positions on a graph).","suggestion":"Define a state vector $X_k$ representing the probabilities of being in each state, derive the transition matrix $M$ such that $X_k = M X_{k-1}$, and use matrix exponentiation or iterative multiplication to find $X_n$."},{"situation":"When a system's state vector $X_k$ is large, but the desired final probability $P_n$ is a simple linear combination of only a few components of $X_n$ (e.g., $P_n = c^T X_n$).","suggestion":"Analyze the structure of the transition matrix $M$ and the target vector $c$ to find a lower-dimensional recurrence relation or an invariant relationship involving only the necessary components, simplifying the calculation from $O(N^3 \\log n)$ to $O(n)$ or better."},{"situation":"When an iterative calculation based on a recurrence relation shows an initial simple pattern (e.g., constant values) that unexpectedly breaks after a few steps.","suggestion":"Do not assume the initial pattern continues; instead, rigorously derive the full recurrence relation for the required components, or revert to calculating the components explicitly using the base case transition matrix until the pattern (or lack thereof) is confirmed for the required index."},{"situation":"When the desired probability $P_n$ is defined as the sum of probabilities of being in a subset of states, and the transition rules show a structural relationship between the sum of components at step $k$ and the sum at step $k+1$ (e.g., $P_{k+1} = \\frac{1}{2} S_k$).","suggestion":"Use the derived structural relationship to define a simplified recurrence for the required sum ($S_k$), incorporating the known behavior of the remaining components ($x_k$) into the recurrence relation for $S_{k+1}$."}],"2021-II-9":[{"situation":"When the greatest common divisor (GCD) of two expressions involving powers of the same base, $b^m \\pm 1$ and $b^n \\mp 1$, is required to be greater than 1.","suggestion":"Identify the prime factors $p$ that divide both expressions. Use the order of the base modulo $p$, $k = \\text{ord}_p(b)$, to translate the divisibility conditions into constraints on $k$ relative to $m$ and $n$ (i.e., $k \\mid n$ and $k \\mid 2m$ but $k \\nmid m$)."},{"situation":"When the condition derived from the order of an element $k$ is that $v_2(k) = v_2(m) + 1$ and $v_2(k) \\le v_2(n)$ (where $v_2(x)$ is the exponent of 2 in the prime factorization of $x$).","suggestion":"Reformulate the condition as an inequality solely on the 2-adic valuations: $v_2(n) \\ge v_2(m) + 1$. Then, count the number of integers in the range whose 2-adic valuation matches a specific exponent $a$ (e.g., $C(a)$)."},{"situation":"When counting pairs $(m, n)$ in a range $\\{1, \\dots, N\\}$ based on a condition involving $v_2(m)=a$ and $v_2(n)=c$ (e.g., $c \\ge a+1$).","suggestion":"Iterate over all possible values of $a$ (from 0 up to $\\lfloor \\log_2 N \\rfloor$). For each $a$, multiply the count $C(a)$ by the cumulative count of $n$'s satisfying the required condition on $c$ (i.e., $\\sum_{c \\ge a+1} C(c)$), and sum these products."},{"situation":"When an initial counting attempt based on a derived necessary condition yields a result that seems suspiciously close to the total number of possibilities (e.g., $605$ vs $900$ total pairs).","suggestion":"Verify the derived condition by calculating the count for the complement case (where the GCD is 1) using the same structural counting method. If the sum of the two counts equals the total sample space size, the derived condition is confirmed."}],"2021-II-10":[{"situation":"When multiple spheres (or circles) are tangent to two intersecting planes (or lines) that form an angle $2\\theta$.","suggestion":"Recognize that the centers of the spheres lie in the angle bisecting plane $\\mathcal{B}$. Use the relationship $r_i = d_i \\sin\\theta$, where $d_i$ is the distance from the center $C_i$ to the line of intersection $\\ell$, to establish a constant ratio $\\sin\\theta = r_i/d_i$ across all objects."},{"situation":"When the centers of objects lie in a plane $\\mathcal{B}$ and their distances $d_i$ to a line $\\ell$ (the intersection of the boundary planes) are known, and the objects are mutually tangent.","suggestion":"Set up a coordinate system in $\\mathcal{B}$ where $\\ell$ is the x-axis. Use the Pythagorean theorem on the distances between centers, $|C_i C_j|^2 = (x_i-x_j)^2 + (d_i-d_j)^2$, incorporating the known tangency distances $|C_i C_j| = r_i+r_j$."},{"situation":"When two objects have equal radii ($r_1=r_2$) and their centers $C_1, C_2$ are in the same plane $\\mathcal{B}$ perpendicular to the line $\\ell$.","suggestion":"Use the symmetry of the setup: the horizontal distance $|x_1-x_2|$ between the centers must equal the sum of their radii, $2r_1$, because their vertical distances $d_1=d_2$ cancel out in the distance formula."},{"situation":"When the distance $D$ required is the projection of a segment $C_i T$ onto the boundary plane $\\mathcal{P}$, where $T$ is the point of tangency on $\\mathcal{P}$.","suggestion":"Identify the right triangle formed by the center $C_i$, the point of tangency $T$, and the projection of $C_i$ onto $\\ell$ (let this point be $O$). The hypotenuse is $d_i$, the angle between $d_i$ and $D$ is $\\theta$ (the angle between $\\mathcal{B}$ and $\\mathcal{P}$), leading to the relationship $D = d_i \\cos\\theta$."}],"2021-II-11":[{"situation":"When a problem involves filtering a large set of initial candidates based on sequential rounds of 'yes/no' or 'I know/I don't know' responses from multiple agents.","suggestion":"Model the process iteratively: Define the initial candidate set $C$. For the first round of filtering (e.g., 'NO'), calculate the frequency $F(x)$ of every element $x$ across all sets in $C$. Retain only sets $S$ where the minimum frequency of its elements, $\\min_{x \\in S} F(x)$, meets the condition implied by the response (e.g., if all say NO, retain $S$ only if $\\min F(x) \\ge 2$)."},{"situation":"When a set $S$ is filtered in a second round based on agents now knowing the results of the first round (e.g., 'All deduce $S$').","suggestion":"Using the reduced set $C'$ from the previous step, recalculate the frequency $F'(x)$ of every element $x$ across all sets in $C'$. Retain only sets $S \\in C'$ where every element $x \\in S$ is unique within $C'$, i.e., $\\max_{x \\in S} F'(x) = 1$."},{"situation":"When the initial constraints define a set of candidates based on divisibility rules and range restrictions (e.g., two-digit numbers, multiples of $k_1$ and $k_2$).","suggestion":"Systematically enumerate the initial candidate set $C$ by checking the intersection of arithmetic progressions defined by the divisibility rules within the specified range, and then verify the count of elements."},{"situation":"When the final answer requires summing the maximum (or minimum) element from the remaining valid sets $S^*$ derived through iterative filtering.","suggestion":"After the final filtering step yields $C''$, identify the required extremal element (maximum or minimum) for each set $S \\in C''$ and compute the required sum or product."}],"2021-II-12":[{"situation":"When the area $K$ of a convex quadrilateral is known, and the lengths of its diagonals $p$ and $q$ are related to the angle $\\theta$ between them.","suggestion":"Apply the area formula $K = \\frac{1}{2} pq \\sin \\theta$ to establish an equation involving $pq \\sin \\theta$."},{"situation":"When the four side lengths $a, b, c, d$ of a convex quadrilateral are known, and the angle $\\theta$ between the diagonals is involved.","suggestion":"Use the relationship derived from the Law of Cosines on the four internal triangles: $a^2 - b^2 + c^2 - d^2 = \\pm 2 pq \\cos \\alpha$, where $\\alpha$ is one of the angles formed by the diagonals. If $\\theta$ is the acute angle, use $pq \\cos \\theta = \\frac{1}{2} |a^2 - b^2 + c^2 - d^2|$."},{"situation":"When you have derived expressions for $pq \\sin \\theta$ and $pq \\cos \\theta$ (or their absolute values) for the acute angle $\\theta$ of a quadrilateral.","suggestion":"Divide the sine expression by the cosine expression to find $\\tan \\theta = m/n$, and then compute the required sum $m+n$ after ensuring $m$ and $n$ are coprime."}],"2021-II-13":[{"situation":"A congruence equation $A^n \\equiv n \\pmod{M}$ must be solved, where $A$ has a known multiplicative order $d$ modulo $M$.","suggestion":"Use the order $d$ to reduce the exponent: $A^n \\equiv A^{n \\pmod{d}} \\pmod{M}$. This transforms the equation into a system involving $n \\pmod{d}$ and $n \\pmod{M}$, which can often be solved using the Chinese Remainder Theorem structure or systematic testing based on the period $d$."},{"situation":"A system of congruences must be satisfied, one involving a small modulus $m_1$ (e.g., $m_1=8$) and another involving a large modulus $m_2$ (e.g., $m_2=125$), where the structure of the solution space is constrained by the smaller modulus.","suggestion":"Solve the congruence for the smaller modulus first to generate a set of candidates $n \\equiv r \\pmod{m_1}$. Then, test these candidates sequentially against the congruence for the larger modulus, using the multiplicative order properties of the base if applicable."},{"situation":"When solving $A^n \\equiv n \\pmod{M}$ where $M$ is a prime power $p^k$, and $A$ is coprime to $p$.","suggestion":"Calculate the multiplicative order $d$ of $A$ modulo $p^k$. Since $d$ divides $\\phi(p^k)$, test candidates $n$ by checking $n \\pmod{d}$ against $n \\pmod{p^k}$."},{"situation":"When a problem requires solving a system of congruences that results from splitting a modulus $M=m_1 m_2$ (e.g., $1000 = 8 \\times 125$), and one part involves a power of the prime dividing $M$ (e.g., $2^n \\pmod{8}$ or $5^n \\pmod{125}$).","suggestion":"Analyze the behavior of the terms involving the prime factor $p$ separately. If $n$ is large enough (i.e., $n \\ge k$ for $p^k$), terms like $p^n$ vanish modulo $p^k$, simplifying the congruence significantly."}],"2021-II-14":[{"situation":"When geometric constraints (like perpendicularity or angle relationships) lead to multiple possible configurations for how two derived angles ($\\delta_X, \\delta_Y$) combine to form a known total angle ($\\angle XOY$).","suggestion":"Systematically test all combinations ($\\delta_X + \\delta_Y$, $|\\delta_X - \\delta_Y|$) against the known total angle, and check the resulting parameter value against all stated constraints (e.g., acute/obtuse conditions). If a contradiction arises, prioritize the algebraic consistency of the derived relationships over potentially restrictive geometric constraints, as the latter might be subtly violated or misapplied."},{"situation":"When the position of a point $Y$ on a line segment (like $BC$) is constrained by perpendicularity to a line passing through the circumcenter $O$ and the centroid $G$ (the Euler line).","suggestion":"Use the property that the line $GY$ is perpendicular to $OG$ to establish a right triangle $\\triangle OGY$. Relate the angle $\\angle GOY$ to the angle $\\theta$ between the Euler line $OG$ and the line perpendicular to $BC$ ($OM_a$) using the fact that the angle between $GY$ and $BC$ is also $\\theta$."},{"situation":"When a trigonometric identity involving angles parameterized by $k$ (e.g., $\\tan \\theta = f(k)$) must be satisfied simultaneously with a linear relationship between the derived angles and $k$ (e.g., $2\\theta = ak + b$).","suggestion":"Substitute the linear relationship into the trigonometric identity by setting $\\theta = (ak+b)/2$. This transforms the problem into solving a single equation in terms of $k$ (often involving half-angle formulas or tangent addition/subtraction formulas) to find the specific value of the parameter $k$."},{"situation":"When the final answer requires the sum of the numerator and denominator of a fraction $m/n$ representing a derived parameter $k$, where $m$ and $n$ are coprime integers.","suggestion":"After finding the value $k=m/n$, explicitly verify that $\\gcd(m, n) = 1$ by checking prime factors. If they are not coprime, simplify the fraction before calculating the final sum $m+n$."}],"2021-II-15":[{"situation":"When a function $f(n)$ is defined piecewise based on whether $n$ is a perfect square, and the definition involves iterating the function until a square is reached.","suggestion":"Define $k$ such that $(k-1)^2 < n < k^2$. Express the distance $D = k^2 - n$ and use this parameter $D$ to write an explicit formula for $f(n)$ in terms of $k$ and $D$ by analyzing the required number of steps."},{"situation":"When an iterative function $g(n)$ stops upon reaching a perfect square $j^2$, and the step size depends on the parity of the current argument relative to the target square's parity.","suggestion":"Determine the parity relationship between the starting value $n$ and the nearest square $k^2$. If the parities mismatch, identify the next square $(k+1)^2$ as the true stopping point, calculate the total steps based on the distance to that square, and use the known value $g(\\text{square})$ to form an explicit formula for $g(n)$."},{"situation":"When solving an equation involving parameters derived from structural definitions (like $D$ and $k$ in this context) that must satisfy bounds derived from the initial structural assumption (e.g., $1 \\le D \\le 2k-2$).","suggestion":"Substitute the derived relationship (e.g., $D = A k + B$) into the bounding inequalities. Solve the resulting linear inequalities for the free parameter (e.g., $k$ or $m$) and use modular arithmetic constraints (e.g., $k \\equiv 2 \\pmod 3$) to find the smallest integer satisfying all conditions."},{"situation":"When a ratio of two derived expressions involving parameters $k$ and $D$ must equal a fixed rational number $p/q$.","suggestion":"Cross-multiply to obtain a linear Diophantine equation in $D$ and $k$. Use the structural definition of $D$ in terms of $k$ (or vice versa) to reduce the equation to a single variable, and then apply modular arithmetic to find the general form of the solution."}],"2022-I-1":[{"situation":"When two polynomials, $P(x)$ and $Q(x)$, of degree $n$, have leading coefficients that are additive inverses (e.g., $a_n$ and $-a_n$), and the goal is to find the sum of their constant terms, $P(0) + Q(0)$.","suggestion":"Define the sum polynomial $S(x) = P(x) + Q(x)$. This operation eliminates the highest degree terms, reducing the degree of $S(x)$ to at most $n-1$. Determine the values of $S(x)$ at the known shared input points, and then use interpolation (or the two-point formula if the resulting degree is 1) to find $S(0)$."},{"situation":"When the sum of two polynomials, $S(x) = P(x) + Q(x)$, simplifies to a linear function, $S(x) = mx + k$, and two points $(x_1, y_1)$ and $(x_2, y_2)$ on $S(x)$ are known.","suggestion":"Calculate the slope $m = (y_2 - y_1) / (x_2 - x_1)$. Then, use the point-slope form to find the y-intercept $k = y_1 - m x_1$. The required value $P(0) + Q(0)$ is equal to $S(0) = k$."},{"situation":"When a problem requires finding the sum of constant terms ($P(0) + Q(0)$) but also provides information that allows calculating the difference of constant terms ($P(0) - Q(0)$) via a different polynomial combination.","suggestion":"Calculate both the sum $S(x) = P(x) + Q(x)$ and the difference $D(x) = P(x) - Q(x)$ at the known input points. If $S(x)$ is linear and $D(x)$ is quadratic (or vice versa), solve for $S(0)$ and $D(0)$ independently, and then use the resulting system of two linear equations in $P(0)$ and $Q(0)$ if necessary (though often only one combination is needed)."}],"2022-I-2":[{"situation":"When an integer $N$ is represented in two different bases (e.g., base 10 and base $k$) using the same digits in a permuted order.","suggestion":"Write the two expressions for $N$ algebraically, equate them, and rearrange the resulting linear Diophantine equation to isolate one variable or a small coefficient combination."},{"situation":"When a linear Diophantine equation $Ax + By = Cz$ is derived, and the variables $x, y, z$ are constrained to be single digits (e.g., $0 \\le x, y, z \\le 9$).","suggestion":"Use the constraints on the largest variable to establish tight bounds on the other variables, then iterate systematically over the possible values of the leading digit ($A$ or $C$ in the equation) and check for integer solutions for the remaining variables within their bounds."},{"situation":"When solving a linear Diophantine equation $Ax + By = C$ where the coefficients $A, B, C$ are known, and you need to ensure the resulting third variable $z$ (where $C = Az + Bw$) is an integer.","suggestion":"Reduce the equation modulo the coefficient of the third variable (e.g., $Ax + By \\equiv 0 \\pmod 8$ if the third variable is multiplied by 8), and use the resulting modular congruence to quickly filter which pairs $(x, y)$ can yield an integer solution for $z$."},{"situation":"When iterating through a small range of possibilities (e.g., $a=1$ to $9$) in a Diophantine problem yields bounds that are very close to integers, suggesting potential floating-point errors or near-misses.","suggestion":"Verify the bounds calculation precisely using fractions or by checking the resulting value of the third variable ($c$) for integer status, rather than relying solely on the decimal approximation of the bounds."}],"2022-I-3":[{"situation":"When points are defined by being equidistant from a line (a side of a polygon) and a fixed distance (the height to the opposite base), leading to an absolute value equation involving coordinates.","suggestion":"Set up a coordinate system, express the line equation in general form $Ax+By+C=0$, use the distance formula, and solve the resulting two cases derived from the absolute value. Use geometric constraints (like angle type: acute/obtuse) to select the correct case."},{"situation":"When finding the position of a point on a midline of a trapezoid defined by angle bisectors originating from the base vertices.","suggestion":"Use the geometric definition of the angle bisector: the ray must lie within the angle. If the angle is acute, the ray must point towards the interior of the figure relative to the base line; if obtuse, the constraint on the coordinate might be different. Use the slope of the bisector derived from the angle's tangent half-angle formula to fix the coordinate, overriding potentially ambiguous results from the distance formula."},{"situation":"When a geometric figure (like a trapezoid) possesses an axis of symmetry, or when two corresponding points are defined symmetrically (e.g., relative to the vertical midline).","suggestion":"If the figure is symmetric about the $y$-axis, enforce the condition $x_Q = -x_P$ on the coordinates derived from the distance equations to quickly resolve ambiguities or verify consistency between the two points."},{"situation":"When calculating the height of a trapezoid given the lengths of the two parallel bases and the two non-parallel sides.","suggestion":"Project the endpoints of the shorter base onto the line containing the longer base. This creates a right triangle whose hypotenuse is one leg, and whose legs are the height and the difference in the horizontal projections of the legs."}],"2022-I-4":[{"situation":"When an equation involving complex numbers $z_1^r = z_2^s$ must hold, where $z_1$ and $z_2$ are roots of unity, leading to an equality of arguments modulo $2\\pi$.","suggestion":"Convert all complex numbers to polar form ($e^{i\\theta}$), equate the arguments, multiply by the least common multiple of the denominators in the resulting linear equation, and express the result as a linear Diophantine equation involving an integer parameter $k$ (representing the $2\\pi$ multiples)."},{"situation":"When a linear Diophantine equation $Ar + Bs = C(k)$ must be solved subject to bounds $1 \\le r \\le R$ and $1 \\le s \\le S$, where $C(k)$ depends linearly on an integer parameter $k$.","suggestion":"Determine the overall range of the constant term $C$ based on the bounds $R$ and $S$. Use this range to find the possible integer range for $k$. Then, for a fixed $C$ (or fixed $k$), derive the explicit bounds for one variable (e.g., $s$) in terms of $C$ using the constraints $1 \\le r \\le R$ and $1 \\le s \\le S$, involving floor and ceiling functions."},{"situation":"When counting solutions to bounds involving floor/ceiling functions of a parameter $k$ (e.g., $s_{min} = \\max(1, \\lceil f(k) \\rceil)$ and $s_{max} = \\min(S, \\lfloor g(k) \\rfloor)$).","suggestion":"Systematically partition the range of $k$ into disjoint intervals where the $\\max/\\min$ choices remain constant (i.e., where the ceiling/floor functions resolve to fixed boundaries like 1 or $S$). Calculate the number of solutions $N_k$ for each interval, noting if $N_k$ is constant or varies linearly with $k$ within that partition."},{"situation":"When the number of solutions $N_k$ within a partition is constant across many values of $k$.","suggestion":"Verify that the linear relationship between the bounds $s_{min}$ and $s_{max}$ simplifies such that the difference $s_{max} - s_{min}$ becomes independent of $k$ within that specific partition."}],"2022-I-5":[{"situation":"When two objects travel between two points separated by a fixed distance, and the path taken is constrained by an external constant velocity (like a river current or wind).","suggestion":"Define the ground velocity $\\mathbf{v}_g$ as the vector sum of the object's intrinsic velocity $\\mathbf{v}_w$ and the external velocity $\\mathbf{v}_r$. Use the known displacement vector $\\mathbf{d}$ and time $T$ to express $\\mathbf{v}_g = \\mathbf{d}/T$, then solve for the required $\\mathbf{v}_w = \\mathbf{v}_g - \\mathbf{v}_r$ and apply the magnitude constraint $|\\mathbf{v}_w| = v_{\\text{max}}$."},{"situation":"When the destination point $P$ is defined by an equidistance constraint relative to two starting points $S$ and $M$ on a line perpendicular to the direction of travel.","suggestion":"Set up a coordinate system where $S$ and $M$ lie on the x-axis and the destination line is $y=W$. Use the distance formula to show that the x-coordinate of $P$ must be exactly halfway between the x-coordinates of $S$ and $M$."},{"situation":"When solving a system of equations derived from two different paths (e.g., two different swimmers) where the equations involve terms like $(A \\pm B)^2$ and $(A \\mp B)^2$.","suggestion":"Manipulate the system by adding and subtracting the two derived equations. Adding them eliminates the cross-term (e.g., $2AB$), while subtracting them isolates the cross-term (e.g., $2AB$ vs $-2AB$)."},{"situation":"When the time $T$ is unknown, but the path geometry yields a relationship between the distance $D$ and $T$ (e.g., $D = k T$).","suggestion":"Substitute this linear relationship back into one of the quadratic constraint equations to form a single quadratic equation solely in terms of $D$ (or $T$), allowing for direct solution."}],"2022-I-6":[{"situation":"When counting combinations where a subset of the chosen elements must satisfy a specific linear relationship (like forming an Arithmetic Progression, AP) with other fixed elements in the set.","suggestion":"Systematically partition the exclusion cases based on how many of the required elements are variables versus fixed constants. Check cases involving 0, 1, 2, or all variables, ensuring the constraints on the variables' ranges are respected in each case."},{"situation":"When generating excluded pairs $(a, b)$ from multiple distinct structural conditions (e.g., APs involving only $a$, APs involving $a$ and $b$, etc.).","suggestion":"Use the Principle of Inclusion-Exclusion (PIE) by explicitly listing the sets of excluded pairs derived from each structural condition, identifying the intersection (overlap) between these sets, and summing the unique counts."},{"situation":"When an Arithmetic Progression (AP) must be formed using two variables ($a, b$) and two fixed elements ($x_1, x_2$) from a known set, constrained by $x_1 < a < b < x_2$.","suggestion":"Use the property that the middle terms average to the mean of the outer terms: $a+b = x_1+x_2$. Additionally, check the common difference condition: $a-x_1 = b-a = x_2-b$. Solve the resulting system of linear equations for $a$ and $b$, and verify if the solutions satisfy the ordering constraints."},{"situation":"When an AP must be formed using two variables ($a, b$) and two fixed elements ($x_1, x_2$) from a known set, constrained by $x_1 < x_2 < a < b$ or $a < b < x_1 < x_2$.","suggestion":"Use modular arithmetic to quickly filter potential fixed pairs. If $x_1, x_2, a, b$ form an AP with common difference $d$, then $x_2 - x_1 = k \\cdot d$ for some integer $k$. For the case $x_1, x_2, a, b$, we must have $x_2 - x_1$ divisible by 2 (if $a, b$ are the next two terms) or 3 (if $a, b$ are the third and fourth terms, etc.)."}],"2022-I-7":[{"situation":"When minimizing a ratio $E = N/D$ where $N$ and $D$ are derived from partitioning a fixed set of factors (like $9!$ in this case) into three groups, $P_1, P_2, D$, such that $P_1 P_2 D$ is constant, and $N = P_1 - P_2$ must be minimized subject to $P_1 > P_2$.","suggestion":"First, test the configuration that maximizes $D$ (by choosing the largest possible factors for $D$), as this often yields a good initial bound. Then, systematically explore configurations where $D$ is slightly smaller, checking if the resulting product $P_1 P_2$ allows for a significantly smaller difference $N$ (e.g., $N=2$ instead of $N=4$ or $N=6$) that results in a smaller overall ratio $E$."},{"situation":"When the product $P_1 P_2$ is fixed, and the goal is to minimize the difference $N = P_1 - P_2$ where $P_1$ and $P_2$ must be formed by partitioning a specific set of available integers.","suggestion":"Calculate the target value $X = \\sqrt{P_1 P_2}$. Search for the pair of factors $(P_1, P_2)$ closest to $X$ that can be constructed using the available set elements. If the set elements are small integers, this often involves checking factor pairs near the square root."},{"situation":"When a systematic search for the minimum value $E=N/D$ suggests that the best solution might involve $N=1$, but direct construction is difficult.","suggestion":"Establish an upper bound $D_{\\text{crit}}$ based on the best known solution (e.g., if the current minimum is $1/K$, then we only need to check $D < K$). For every possible denominator $D < D_{\\text{crit}}$ formed by the allowed factors, calculate the required product $P_1 P_2 = C/D$. Then, check if $P_1 P_2$ can be written as $P_2(P_2+1)$ by solving the resulting quadratic equation for $P_2$ and verifying if the required factors for $P_2$ and $P_2+1$ can be formed from the remaining set elements."}],"2022-I-8":[{"situation":"When a geometric configuration (e.g., tangency conditions, distances) derived from standard axioms leads to a contradiction, suggesting the configuration is impossible as stated.","suggestion":"Assume the problem intends for a known, related configuration to hold, often one derived from a specific established theorem or formula for that geometric setup (like Malfatti circles or related constructions), and use that standard result to proceed."},{"situation":"When the final answer format is specified as $\\sqrt{a} - \\sqrt{b}$ or $\\sqrt{a} + \\sqrt{b}$ where $a$ and $b$ are integers, and the derived intermediate result involves nested radicals (e.g., $C\\sqrt{D} \\pm E$).","suggestion":"Attempt to rewrite the intermediate result $X$ by squaring it, $X^2 = (C\\sqrt{D} \\pm E)^2$, and then express $X$ as $\\sqrt{X^2}$ to match the required form $\\sqrt{a} \\pm \\sqrt{b}$ by identifying $a$ and $b$ with the terms in the expanded square."},{"situation":"When calculating the required sum $a+b$ after expressing a result $L$ in the form $\\sqrt{a} - \\sqrt{b}$ (where $L$ is known to be positive).","suggestion":"If $L = \\sqrt{A} - \\sqrt{B}$ where $A$ and $B$ are known, calculate $a+b$ by finding $a=A$ and $b=B$ if the expression is fully simplified, or by using the identity $L^2 = A+B - 2\\sqrt{AB}$ to relate $L^2$ to $a+b$ and $ab$ if the form $\\sqrt{a}-\\sqrt{b}$ is derived from a different structure."},{"situation":"When dealing with an equilateral triangle inscribed in a circle of radius $R$, and considering circles tangent to two sides and the main circumcircle.","suggestion":"Recall or derive the standard formula for the radius of the resulting tangent circles (which often yields results involving $2\\sqrt{3} - 3$) and apply it directly, especially if coordinate geometry leads to inconsistencies."}],"2022-I-9":[{"situation":"When counting permutations of a multiset where the constraint depends on the relative positions (indices) of identical items.","suggestion":"Determine the parity (odd/even) or modular class of the indices required by the constraint. If the constraint forces one item of a pair into an odd slot and the other into an even slot, count the arrangements by independently permuting the distinct types in the odd slots and the distinct types in the even slots."},{"situation":"When calculating the total number of distinct arrangements of $2n$ items consisting of $n$ pairs of identical items.","suggestion":"Use the multinomial coefficient formula for permutations with repetition: $\\frac{(2n)!}{2^n}$."},{"situation":"When simplifying a probability ratio involving factorials and powers, such as $\\frac{(n!)^2 \\cdot 2^n}{(2n)!}$.","suggestion":"Expand the larger factorial $(2n)!$ until it reaches $n!$, cancel the $n!$ terms, and then systematically cancel common factors between the remaining terms in the numerator ($n! \\cdot 2^n$) and the denominator."}],"2022-I-10":[{"situation":"When the distance between the centers of two spheres ($d_{ij}$) and the distance between the centers of their intersection circles ($L_{ij}$) are known, where the spheres intersect a common plane.","suggestion":"Apply the Pythagorean theorem in the plane perpendicular to the line connecting the sphere centers: $L_{ij}^2 = d_{ij}^2 - (h_i - h_j)^2$, where $h_i$ and $h_j$ are the distances from the sphere centers to the intersection plane."},{"situation":"When the intersection radius ($r$) of several spheres with a common plane is constant, and the sphere radii ($r_i$) are known.","suggestion":"Use the relationship $h_i^2 = r_i^2 - r^2$ to establish a system of equations relating the heights $h_i$ based on the differences of squares of the known radii: $h_j^2 - h_i^2 = r_j^2 - r_i^2$."},{"situation":"When the difference between two heights ($|h_i - h_j|$) is found from a distance relationship, and the difference of their squares ($h_i^2 - h_j^2$) is known from the radii differences.","suggestion":"Factor the difference of squares: $(h_i - h_j)(h_i + h_j) = r_i^2 - r_j^2$. Use the known difference $|h_i - h_j|$ to solve for the sum $h_i + h_j$, creating a solvable linear system for $h_i$ and $h_j$."},{"situation":"When the distance between two sphere centers ($d_{ij}$) is calculated from the sum of their radii ($r_i + r_j$), and the heights ($h_i, h_j$) are determined.","suggestion":"Calculate the squared distance between the circle centers ($L_{ij}^2$) using the projection formula $L_{ij}^2 = d_{ij}^2 - (h_i - h_j)^2$ to find the required unknown distance between intersection points."}],"2022-I-11":[{"situation":"A circle is tangent to two parallel lines, and the distance between these lines is given or implied by the geometry.","suggestion":"Set the distance between the parallel lines equal to the diameter ($2r$) of the circle. If the lines are sides of a trapezoid/parallelogram, this distance is the height corresponding to those sides."},{"situation":"When a point outside a circle has two secants intersecting the circle, yielding segment lengths ($a, b$ and $c, d$) such that the total lengths are $a+b$ and $c+d$.","suggestion":"Apply the Power of a Point Theorem: $a(a+b) = c(c+d)$. Use this to find the length of the tangent segment from the external point, $t$, where $t^2$ equals the power."},{"situation":"When a circle is inscribed within a corner defined by two intersecting lines (or sides of a polygon) and the tangent segments from the vertex to the circle are known.","suggestion":"Relate the tangent segment length ($t$) to the inradius ($r$) and the angle ($\\theta$) at the vertex using the trigonometric relation $t = r \\cot(\\theta/2)$."},{"situation":"When the sides ($c, d$) of a parallelogram and the length of a diagonal ($D$) are related to the interior angle ($\\alpha$) via geometric constraints derived from an inscribed circle.","suggestion":"Use the Law of Cosines on the triangle formed by the two sides and the diagonal: $D^2 = c^2 + d^2 \\pm 2cd \\cos \\alpha$. Express $\\cos \\alpha$ in terms of $r$ using the half-angle tangent derived from the tangency condition, and solve the resulting algebraic equation for $r$."}],"2022-I-12":[{"situation":"When summing over subsets of a fixed size $k$ (e.g., $\\sum_{|A|=k, |B|=k} f(|A \\cap B|)$) where the structure is highly symmetric.","suggestion":"Use indicator variables or linearity of expectation to count the total contribution of a single element $x$ across all pairs of sets, exploiting symmetry to simplify the sum from a double summation over sets to a product of counts."},{"situation":"When the sum involves squared binomial coefficients, $\\sum_{j} \\binom{m}{j}^2$, often arising from counting pairs of sets of fixed size.","suggestion":"Apply the identity derived from Vandermonde's convolution specialization: $\\sum_{j=0}^{m} \\binom{m}{j}^2 = \\binom{2m}{m}$ to obtain a closed form for the sum."},{"situation":"When calculating the ratio of consecutive terms of a sequence defined by factorials or binomial coefficients, $S_{n+1}/S_n$.","suggestion":"Express the ratio using the general forms, isolate the ratio of the binomial coefficients, simplify this ratio by expanding the factorials, and then substitute the resulting simple algebraic expression back into the full ratio."},{"situation":"When a fraction $p/q$ is found to be irreducible because $q$ is a product of two distinct primes $r_1, r_2$, and the numerator $p$ is known to be close to a multiple of $r_1$ or $r_2$ (e.g., $p \\equiv c \\pmod{r_i}$ where $c \\ne 0$).","suggestion":"Verify the coprimality by checking the divisibility of the factors of $p$ (which are usually simple linear expressions in $n$) by the prime factors of $q$ (which are $r_1$ and $r_2$) using modular arithmetic."}],"2022-I-13":[{"situation":"When enumerating distinct fractions $K/D$ reduced to lowest terms $p/q$, where $q$ must be a divisor of $D$.","suggestion":"Identify the necessary and sufficient condition for a numerator $p$ to be valid: there must exist a divisor $q$ of $D$ such that $p \\le q$ and $\\gcd(p, q) = 1$. This condition implies that $q$ must be composed only of prime factors of $D$ that $p$ does not share."},{"situation":"When analyzing the set of integers $p$ whose prime factors are restricted to a known finite set $P_D$ (the prime factors of $D$).","suggestion":"Systematically count the number of such integers $p$ that satisfy $p \\le D$ by iterating over the possible exponents for each prime in $P_D$ and checking the magnitude constraint."},{"situation":"When partitioning the set of potential numerators $p \\le D$ into two groups: those whose prime factors are entirely contained in $P_D$ (internal) and those that share at least one prime factor not in $P_D$ (external).","suggestion":"For external numerators, choose the largest possible denominator $q=D$. Since $p \\le D$, all external numerators are valid. For internal numerators, perform a detailed case analysis based on which subset of $P_D$ divides $p$, calculating the maximum possible denominator $D_{P_q}$ for each case and checking the constraint $p \\le D_{P_q}$."},{"situation":"When analyzing the constraint $p \\le q$ where $q$ is a divisor of $D$, and $p$ is divisible by a prime $r$ that is a factor of $D$ (e.g., $r=101$ in $D=9999$).","suggestion":"If $p$ is divisible by a prime $r$ whose highest power in $D$ is $r^k$, then the corresponding denominator $q$ must be a divisor of $D/r^k$. If $p$ is large enough (e.g., $p > D/r^k$), then $p > q$ for all valid $q$, meaning no such $p$ can be a valid numerator."}],"2022-I-14":[{"situation":"When a geometric problem involving angle constraints simplifies significantly if a line segment connecting midpoints of two sides is considered (implying parallelism to the third side).","suggestion":"Use the parallelism property (e.g., $MN || BC$) to relate angles involving the cutting line to the base angles of the triangle ($\\beta, \\gamma$), often leading to a required sum or difference of angles ($\\phi_M \\pm \\phi_N = \\text{constant}$). Verify this constant using the location of the intersection point relative to the midline."},{"situation":"When the problem requires finding integer side lengths $(a, b, c)$ of a triangle given a constraint involving a geometric construction that yields a complex trigonometric equation involving the angles $\\beta$ and $\\gamma$.","suggestion":"Test highly symmetric or near-symmetric integer solutions (e.g., $b=c$, or $b, c$ differing by 1) that satisfy necessary linear constraints (like perimeter sums). If symmetric cases fail, check if the resulting near-symmetric configuration forces the trigonometric identity to hold for the unique integer solution."},{"situation":"When a geometric construction partitions a figure, and the perimeter of one resulting piece is expressed as a linear combination of the original perimeter and the length of the cut ($P_{new} = P/2 + L$).","suggestion":"Use the given perimeter constraint to establish a linear relationship between the unknown side lengths ($b+c = \\text{constant}$ if $a$ is fixed). Use this linear relationship to simplify the subsequent geometric/trigonometric equations, often by substituting one variable."},{"situation":"When analyzing the location of an intersection point $I$ relative to a midline $MN$ in a triangle $ABC$ where $M$ and $N$ are midpoints of $AB$ and $AC$ respectively.","suggestion":"Classify the possible geometric configurations based on the relative sizes of the side lengths ($b, c$ vs $a$). For each case, determine the required angular relationship between the angles ($\\phi_M, \\phi_N$) the cutting lines make with the midline $MN$ based on the fixed angle at $A$ (e.g., $\\phi_M + \\phi_N = A$ or $\\phi_M + \\phi_N = 180^\\circ - A$)."}],"2022-I-15":[{"situation":"A system of equations involves terms like $\\sqrt{2x-xy}$ where $x, y$ are bounded (e.g., $0 \\le x \\le 2$).","suggestion":"Attempt a trigonometric substitution that linearizes the square root term, such as $x = 2\\sin^2 A$, to transform the algebraic system into a system involving sums/differences of angles."},{"situation":"After trigonometric substitution, the system reduces to finding angles $A, B, C$ based on known sums of pairs, e.g., $\\sin(A+B) = k_1, \\sin(B+C) = k_2$, etc.","suggestion":"List all possible values for the angle sums $S_{AB}, S_{BC}, S_{CA}$ (e.g., $\\theta$ or $\\pi-\\theta$). Use the constraint that the variables $A, B, C$ must be positive (or within a specific geometric range) to select the unique set of sums that satisfies the triangle inequality condition on the sums: $S_{AB} + S_{BC} > S_{CA}$ (when considering $A+B+C$). "},{"situation":"The target expression involves terms like $1-x$, where $x$ was substituted as $2\\sin^2 A$.","suggestion":"Use the half-angle identity in reverse: $1 - 2\\sin^2 A = \\cos(2A)$. Rewrite the target expression entirely in terms of cosines of double angles, $\\cos(2A), \\cos(2B), \\cos(2C)$."},{"situation":"The final calculation requires evaluating a product of cosines of specific angles, such as $\\cos(\\alpha) \\cos(\\beta) \\cos(\\gamma)$, where $\\alpha, \\beta, \\gamma$ are known.","suggestion":"Pair the terms strategically. If $\\beta + \\gamma = \\pi/2$ (or $\\beta$ and $\\gamma$ are complementary angles like $\\pi/12$ and $5\\pi/12$), use the identity $\\cos(\\theta) \\cos(\\pi/2 - \\theta) = \\cos(\\theta) \\sin(\\theta) = \\frac{1}{2}\\sin(2\\theta)$ or directly calculate the product using known values for $\\cos(15^\\circ)$ and $\\cos(75^\\circ)$."}],"2022-II-1":[{"situation":"When an initial ratio $A_1/C_1 = p/q$ is given, and subsequent changes involve adding known total amounts ($X$) and an unknown sub-component ($x$) of that total, resulting in a new ratio $A_2/C_2 = r/s$.","suggestion":"Parameterize the initial state using $C_1 = qk$ and $A_1 = pk$. Set up the final state $C_2 = qk + X$ and $A_2 = pk + x$. Substitute into the final ratio equation and rearrange to isolate the variable $k$ in terms of $x$ (or vice versa), resulting in a linear Diophantine equation relating $k$ and $x$."},{"situation":"When a linear Diophantine equation $Ak = Bx + D$ is derived from constraints involving positive integer solutions ($k>0$) and bounded variables ($0 \\le x \\le M$).","suggestion":"Use the constraint $k>0$ to establish a strict lower bound on the variable $x$. Then, use modular arithmetic (e.g., $Bx + D \\equiv 0 \\pmod{A}$) to find the required congruence class for $x$. Find the smallest integer $x$ that satisfies both the bound and the congruence, and check if it respects the upper bound $M$."},{"situation":"When the objective function (e.g., minimizing $A_2 = pk + x$) depends linearly on both the primary parameter $k$ and the bounded variable $x$, where $k$ is determined by $x$.","suggestion":"Substitute the expression for $k$ (derived from the Diophantine equation) into the objective function to express the target quantity solely as a function of $x$. Then, minimize this function by choosing the smallest valid integer $x$ that satisfies all derived constraints (positivity, bounds, and modular requirements)."}],"2022-II-2":[{"situation":"When calculating the probability of a specific player winning a multi-stage tournament where the initial pairings are determined randomly and uniformly from a set of possibilities.","suggestion":"Enumerate all distinct, equally likely initial pairing structures (e.g., using partitions or casework on the bracket structure), calculate the conditional probability of the target player winning given that structure, and sum these conditional probabilities weighted by the probability of the structure occurring."},{"situation":"When calculating the probability of winning a final match where the opponent is determined by a previous match whose outcome depends on an unknown probability parameter (e.g., P(J>S)).","suggestion":"Express the final probability as a function of the unknown parameter $r$. If the final result simplifies to a constant value independent of $r$, the unknown parameter can be ignored, and the calculation can proceed using any convenient value (like $r=1/2$) for verification, or by showing the algebraic cancellation directly."},{"situation":"When a player (C) must win a semifinal match against one opponent (A) and then win the final against the winner of another semifinal match (J vs S).","suggestion":"Use the Law of Total Probability conditioned on the opponent in the final. If $P(C>X)$ is known for all $X$, calculate $P(C \\text{ wins final}) = \\sum_{O \\in \\{J, S\\}} P(C>O) P(O \\text{ reaches final})$. If $P(J>S)$ is unknown, ensure the final expression is symmetric or cancels the dependency on $P(J>S)$."},{"situation":"When calculating the probability of winning a match against an opponent whose identity is determined by a prior random event, and the player has known strengths against all potential opponents.","suggestion":"Apply the definition of conditional probability for the final match: $P(C \\text{ wins final}) = P(C>O_1) P(O_1 \\text{ reaches final}) + P(C>O_2) P(O_2 \\text{ reaches final})$, where $O_1$ and $O_2$ are the two potential final opponents."}],"2022-II-3":[{"situation":"When finding the radius of a sphere circumscribing a right pyramid whose base is a regular polygon.","suggestion":"Place the base center at the origin (0,0,0) and the apex at (0,0,h). Define the sphere center K on the altitude at (0,0,z_K). Equate the squared distance from K to the apex, (h-z_K)^2, with the squared distance from K to any base vertex, r^2 + z_K^2, where r is the distance from the base center to a vertex."},{"situation":"When the volume and base dimensions of a right pyramid are known, and the height (h) is required.","suggestion":"Use the formula V = (1/3) * B * h, where B is the base area, to solve directly for h."},{"situation":"When the base of the right pyramid is a square with side length s, and the distance (r) from the center to a vertex is needed.","suggestion":"Calculate the diagonal length d = s*sqrt(2), and set r = d/2. Calculate r^2 for use in distance formulas."},{"situation":"When the radius R of the circumscribing sphere is found to be a rational number m/n in simplest form, and the sum m+n is requested.","suggestion":"Ensure the fraction R is fully reduced (gcd(m, n) = 1) before summing the numerator and denominator."}],"2022-II-4":[{"situation":"When an equation involves multiple logarithms with different bases that share a common algebraic structure (e.g., $B_1 x = C_1$ and $B_2 x = C_2$ where $B_1/B_2$ is a simple constant).","suggestion":"Set the common logarithmic value equal to a variable $y$, convert all equations to exponential form, and then divide the resulting exponential equations to eliminate the variable $x$ and isolate a relationship involving only the bases."},{"situation":"When the division of two exponential expressions results in a base raised to the power $y$ equaling a constant ratio of the original constants, i.e., $(A/B)^y = C/D$.","suggestion":"Take the logarithm base 10 (or the base of the resulting constant ratio, if convenient) of both sides to solve for $y$ directly in the form $y = \\log_{b}(K)$."},{"situation":"When a problem requires finding the sum $m+n$ where $m/n$ is the simplified fraction resulting from an intermediate logarithmic calculation.","suggestion":"Ensure the resulting fraction $m/n$ is fully reduced by checking for common factors, especially if one or both of $m$ or $n$ are prime or near-prime numbers."},{"situation":"When the algebraic manipulation yields a value for a variable (like $y$) that is non-integer and negative, and the original problem required finding a value derived from $x$ (where $x$ was constrained by $x>0$ and base constraints).","suggestion":"Verify that the derived non-integer $y$ does not violate any implicit constraints (like $y \\neq 0$ or $y \\neq 1$) required for the subsequent steps to solve for $x$, and confirm that a valid positive $x$ exists for that $y$."}],"2022-II-5":[{"situation":"When connectivity in a graph on labeled vertices $\\{1, \\ldots, N\\}$ is defined by the absolute difference between labels belonging to a specific set of allowed values $S$.","suggestion":"Model the problem by searching for cycles of length $k$ where the sum of the $k$ edge lengths (differences) must equal the difference between the maximum and minimum vertex labels, $v_{max} - v_{min} = \\sum_{i=1}^k p_i$, where all $p_i \\in S$."},{"situation":"When searching for triangles (cycles of length 3) in a graph where edges are defined by differences $p_1, p_2, p_3$ such that $p_1+p_2=p_3$ must hold for the ordered vertices $v_1 < v_2 < v_3$.","suggestion":"Restrict the search to finding ordered triplets $(p_1, p_2, p_3)$ within the allowed set $S$ such that $p_1 + p_2 = p_3$. Count the number of starting vertices $v_1$ such that $v_1 + p_3 \\le N$ for each valid triplet."},{"situation":"When the set of allowed differences $S$ contains the prime number 2, and the required sum $p_3$ is also in $S$.","suggestion":"Since $p_1 + p_2 = p_3$ and $p_i$ are primes, if $p_3$ is odd, one of $p_1$ or $p_2$ must be 2 (Goldbach's conjecture applied to a small set). Systematically check which pairs $(p_1, p_2)$ sum to an allowed $p_3$ by fixing the value 2 for one of the smaller differences."},{"situation":"When counting the number of distinct sets of vertices $\\{v_1, v_2, v_3\\}$ satisfying a difference condition, where the vertices are ordered $v_1 < v_2 < v_3$ and the constraint is $v_3 \\le N$.","suggestion":"For each valid ordered difference sequence $(p_1, p_2)$ leading to $p_3 = p_1+p_2$, the starting vertex $v_1$ can range from $1$ up to $N - p_3$. The number of possibilities is $N - p_3$. Account for both $(p_1, p_2)$ and $(p_2, p_1)$ if $p_1 \\ne p_2$."}],"2022-II-6":[{"situation":"When maximizing the difference between two terms, $x_j - x_k$, subject to an ordering constraint ($x_1 \\leq x_2 \\leq \\cdots \\leq x_N$) and a constraint on the sum of absolute values ($\\sum |x_i| = C$).","suggestion":"To maximize $x_j - x_k$, attempt to make $x_j$ the largest possible positive value and $x_k$ the smallest possible negative value. This is achieved by concentrating the total positive sum into the terms $x_j$ and higher, and the total negative sum into the terms $x_k$ and lower, setting intermediate terms to zero if consistent with the ordering."},{"situation":"When the ordering constraint $x_1 \\leq x_2 \\leq \\cdots \\leq x_N$ must be maintained while concentrating the total negative sum $S_{neg}$ into the first $k$ terms and the total positive sum $S_{pos}$ into the last $m$ terms.","suggestion":"Assume the optimal configuration sets $x_1 = \\cdots = x_k = a$, $x_{k+1} = \\cdots = x_{N-m} = 0$, and $x_{N-m+1} = \\cdots = x_N = b$. Verify that this configuration is consistent with the ordering ($a \\leq 0$ and $b \\geq 0$) and use the constraints $\\sum x_i = 0$ and $\\sum |x_i| = C$ to solve for $a$ and $b$ simultaneously."},{"situation":"When the sum of absolute values constraint $\\sum |x_i| = C$ is combined with the zero-sum constraint $\\sum x_i = 0$, where $x_i$ are partitioned into negative and positive sets.","suggestion":"Define $S_{neg} = \\sum_{x_i < 0} x_i$ and $S_{pos} = \\sum_{x_i > 0} x_i$. The constraints imply $S_{neg} = S_{pos} = -C/2$. Use this relationship to form a system of linear equations involving the sums of the grouped terms."}],"2022-II-7":[{"situation":"When finding the intersection point (vertex V) of two external common tangents to two circles whose centers lie on a line.","suggestion":"Use the ratio of the radii ($r_2/r_1$) to set up a proportion along the line of centers ($O_1O_2$) based on similar triangles formed by the vertex, the centers, and the points of tangency. Solve for the distance from the vertex to the nearer center ($VO_1$)."},{"situation":"When the base of the triangle formed by three common tangents lies on the internal common tangent ($L_3$).","suggestion":"Recognize that $L_3$ is perpendicular to the line of centers ($O_1O_2$) at the point of tangency ($H$). Calculate the height ($h$) of the triangle as the sum of the distance from the external vertex ($V$) to the center line ($VO_1$) and the radius corresponding to that center ($r_1$ or $r_2$, depending on the configuration)."},{"situation":"When the angle ($\\theta$) between the line of centers and an external tangent is needed, and the distance from the external vertex ($V$) to the nearer center ($O_1$) and the radius ($r_1$) are known.","suggestion":"Use the right triangle formed by $V$, $O_1$, and the point of tangency $T_1$ to find trigonometric ratios. Specifically, calculate $\\sin \\theta = r_1 / VO_1$, then derive $\\tan \\theta$ to relate the height ($h$) to half the base length ($b/2$)."},{"situation":"When the height ($h$) and the angle ($\\theta$) the side makes with the altitude are known for a triangle whose base is perpendicular to the altitude.","suggestion":"Use the relationship $b/2 = h \\cdot \\tan \\theta$ to find half the base length, and then calculate the area using Area $= \\frac{1}{2} b h$."}],"2022-II-8":[{"situation":"When the definition of a function $f(n)$ yields a range of integers $S_n = [L, R-1]$ such that $L \\le n < R$, and the goal is to find $n$ such that $|S_n \\cap \\{1, \\dots, N\\}| = 1$.","suggestion":"First, analyze the minimum possible size of the set, $R-L$. If $R-L=1$ is impossible (due to structural constraints on $L$ and $R$), then $R-L \\ge 2$. For uniqueness, this forces the entire set $S_n$ to either be entirely outside $\\{1, \\dots, N\\}$ (impossible since $n \\in S_n$) or entirely contained within $\\{1, \\dots, N\\}$ such that $n$ is the only element, or $n$ is the largest element in the intersection."},{"situation":"When the structural constraints on $L$ and $R$ (derived from the definition of $f$) imply that $R-L \\ge 2$ for all valid inputs $n$.","suggestion":"If $R-L=k \\ge 2$, the uniqueness condition $|S_n \\cap \\{1, \\dots, N\\}| = 1$ implies that if $n < N$, then $n+1$ must be outside the range, meaning $n+1 \\ge R$. Combined with $n=R-1$, this forces $R-L=1$, a contradiction. Therefore, the only possibility is $n=N$, which requires $L=N$ to ensure $|S_N \\cap \\{1, \\dots, N\\}| = N-L+1 = 1$."},{"situation":"When the definition of $L$ involves the maximum of several linear expressions of the output components, $L = \\max(c_1 x_1, c_2 x_2, \\dots)$.","suggestion":"Test the boundary case where all components defining $L$ are equal, i.e., $c_1 x_1 = c_2 x_2 = \\dots = L$. This configuration often yields the tightest possible constraint or the minimal size for the preimage set $S_n$ (i.e., $R-L$ is minimized)."}],"2022-II-9":[{"situation":"A set of $m$ points on one line ($\\ell_A$) and $n$ points on a parallel line ($\\ell_B$) are connected pairwise, forming $mn$ line segments, and the goal is to count the number of bounded regions created inside the strip between the lines.","suggestion":"Model the configuration as a planar graph. Use Euler's formula ($V - E + R = 2$) adapted for bounded regions ($R_b = E - V + 1$). The key is to correctly count vertices ($V$) and edges ($E$). Assume general position (no three segments intersect at one interior point)."},{"situation":"When constructing the vertices ($V$) of the planar graph formed by segments connecting two sets of points on parallel lines.","suggestion":"The vertices are the $m+n$ endpoints plus the interior intersection points ($I$). Calculate $I$ as the number of ways to choose two pairs of points whose connecting segments cross: $I = \\binom{m}{2}\\binom{n}{2}$."},{"situation":"When constructing the edges ($E$) of the planar graph formed by $mn$ crossing segments between two sets of points on parallel lines.","suggestion":"Edges consist of segments lying on the boundary lines ($m+n-2$ edges) and segments formed by the crossing segments. The total count of edges derived from the $mn$ crossing segments is $mn + 2I$, where $I$ is the number of interior intersection points."},{"situation":"After calculating $V$ and $E$ for the planar graph formed by segments connecting two sets of points on parallel lines.","suggestion":"Apply the simplified formula for bounded regions derived from Euler's formula: $R_b = mn + I - 1$, where $I = \\binom{m}{2}\\binom{n}{2}$."}],"2022-II-10":[{"situation":"When the summand involves a binomial coefficient whose upper index is itself a quadratic polynomial in the summation variable (e.g., $\\binom{n(n-1)/2}{2}$).","suggestion":"Substitute the polynomial expression for the upper index, expand the resulting binomial coefficient fully, and look for a factorable structure that simplifies the expression into a multiple of a lower-order binomial coefficient (e.g., $\\binom{n+c}{r}$)."},{"situation":"When a term $T_n$ simplifies to a constant multiple of a binomial coefficient $\\binom{n+c}{r}$ where $r$ is small (like 3 or 4).","suggestion":"Apply the Hockey-Stick Identity ($\\sum_{i=r}^{m} \\binom{i}{r} = \\binom{m+1}{r+1}$) after adjusting the summation index $n$ to match the lower index of the binomial coefficient."},{"situation":"When calculating a large binomial coefficient $\\binom{N}{K}$ where $K$ is small (e.g., $K=5$) and the final result must be found modulo $M$ (where $M$ is not prime, like $M=1000$).","suggestion":"Write out the full product expansion $\\frac{N(N-1)\\cdots(N-K+1)}{K!}$. Cancel common factors between the numerator and the denominator $K!$ first to simplify the remaining product, then compute the resulting product modulo $M$ using sequential modular multiplication."}],"2022-II-11":[{"situation":"When a point M is defined as the intersection of angle bisectors originating from two adjacent vertices (say D and A) of a quadrilateral ABCD, and M is equidistant from the three lines containing the sides AD, AB, and DC.","suggestion":"Set up a coordinate system with D at the origin and A on the x-axis. Express the common distance $r$ in terms of the angles $2\\alpha$ and $2\\delta$ using the projection of M onto AD, leading to the relation $r (\\cot \\alpha + \\cot \\delta) = AD$ (assuming B and C are on the same side of AD)."},{"situation":"When a point M is the midpoint of a side BC, and its coordinates are related to the coordinates of B and C, which are themselves defined by distances and angles from other vertices (A and D).","suggestion":"Use the midpoint formula $2x_M = x_B + x_C$ and $2y_M = y_B + y_C$. Express $x_B, y_B, x_C, y_C$ using the known side lengths (2 and 3) and the angles $2\\alpha, 2\\delta$ relative to the base AD, and equate these expressions with the coordinates derived from the angle bisector property."},{"situation":"When geometric constraints (like fixed side lengths and angle conditions) lead to an algebraic system that appears overdetermined or contradictory when assuming a specific symmetry (like $\\alpha=\\delta$).","suggestion":"Systematically check the consistency of the derived trigonometric relations (e.g., $\\cos 2\\alpha = f(\\alpha, \\delta)$) against the constraints derived from the side lengths and the midpoint condition. If contradictions arise, test the alternative configuration (e.g., B and C on opposite sides of AD) or re-evaluate the initial geometric interpretation of the angle bisector property."},{"situation":"When the area of a general convex quadrilateral ABCD is sought, and a point M inside is equidistant ($r$) from three sides (AD, AB, DC).","suggestion":"Decompose the area $S$ into the sum of the areas of $\\triangle ABM$, $\\triangle DCM$, $\\triangle ADM$, and $\\triangle BCM$. Since the altitude from M to the three sides is $r$, the first three areas sum to $r \\cdot (AB + DC + AD)/2$. Calculate the remaining area $\\triangle BCM$ using its base $BC$ and the altitude from $M$ to $BC$ (which may or may not be $r$)."}],"2022-II-12":[{"situation":"When minimizing the sum of distances from a point P to a set of fixed points (foci), where the distances are constrained by geometric definitions (like ellipses) that exclude the absolute minimum.","suggestion":"Calculate the absolute minimum value $L_{min}$ achieved by the sum of distances. Then, analyze the boundary cases where the constraints ($a>a_{min}$ or $b>b_{min}$) are approached, determining the infimum $L_{inf}$ of the function over the allowed domain. If an integer answer is expected, the result is $\\lceil L_{inf} \\rceil$ if that value is achievable, or the next integer up."},{"situation":"When the function to be minimized, $f(P) = \\sum d(P, F_i)$, is a sum of Euclidean distances, and the optimal point $P$ is not immediately obvious.","suggestion":"Restrict the search space $P$ to lines defined by pairs of foci or lines connecting the foci of one set to the foci of the other set, as the minimum often lies on such lines or at the intersection points of these lines."},{"situation":"When the infimum of a continuous function $f(x)$ over an open interval $(c, d)$ is $L_{inf}$, and the problem implicitly requires an integer solution $K$ such that $K > L_{inf}$.","suggestion":"Test the smallest integer $K = \\lceil L_{inf} \\rceil$. If $K$ is the target, prove that $f(x)=K$ has a solution $x \\in (c, d)$ by verifying that $K$ lies between $f(c^+)$ and $f(d^-)$ (or $f(d^-)$ and $f(c^+)$) and applying the Intermediate Value Theorem."}],"2022-II-13":[{"situation":"When a generating function $P(x)$ involves a numerator $(x^N-1)^k$ where $N$ is much larger than the target exponent $E$, and the denominator is a product of cyclotomic polynomials or terms like $(x^d-1)$.","suggestion":"Simplify $P(x)$ by factoring out powers of $(x^N-1)$ from the denominator. If $k$ is large enough, $P(x)$ reduces to $(x^N-1)^m Q(x)$ where $m \\ge 0$. Since $E < N$, the coefficient $[x^E] P(x)$ is determined solely by $[x^E] Q(x)$ or $[x^E] (1-mx^N + \\dots) Q(x)$."},{"situation":"When the problem reduces to finding the number of non-negative integer solutions $(x_1, \\dots, x_r)$ to a linear Diophantine equation $c_1 x_1 + \\dots + c_r x_r = K$ derived from a generating function coefficient.","suggestion":"Systematically reduce the equation by checking divisibility constraints (parity, modulo 3, modulo 5, etc.) to constrain the variables. Introduce new variables based on these constraints (e.g., $x_i = k x'_i$) to simplify the coefficients and reduce the number of independent variables."},{"situation":"When solving a linear Diophantine equation $c_1 x_1 + c_2 x_2 + \\dots + c_r x_r = K$ after initial variable reduction leaves only three or four variables with relatively small coefficients.","suggestion":"Iterate over the variable with the largest coefficient, or iterate over a variable whose coefficient forces the tightest constraint on the remaining sum. Group remaining terms to form a simpler two-variable equation, and then iterate over the remaining variable."},{"situation":"When solving a two-variable linear Diophantine equation $ax + by = K$ where $a$ and $b$ are coprime, or nearly coprime, after initial reduction.","suggestion":"Use modular arithmetic to find the required residue class for one variable, say $x \\equiv x_0 \\pmod b$. Determine the minimum non-negative solution $x_{min}$ based on this residue, find the maximum possible value $x_{max} = \\lfloor K/a \\rfloor$, and count the number of solutions by noting that valid $x$ values are $x_{min}, x_{min}+b, x_{min}+2b, \\dots, x_{max}$."}],"2022-II-14":[{"situation":"When determining the minimum number of denominations required to form all sums up to a target value $V_{target}$ (a change-making problem where all sums must be possible).","suggestion":"If the smallest denomination $a$ is not 1, the sum 1 cannot be formed. Therefore, if $V_{target} \\ge 1$, the smallest denomination must be $a=1$. Verify this necessary condition first."},{"situation":"When analyzing the maximum value $V_{\\max}$ achievable by a set of denominations $\\{1, b, c\\}$ with counts $\\{N_1, N_b, N_c\\}$ under the constraint that all sums up to $V_{\\max}$ must be possible (completeness).","suggestion":"Use the necessary and sufficient conditions for completeness: $b \\le N_1 + 1$ and $c \\le N_1 + bN_b + 1$. These constraints severely limit the possible counts $N_i$ for fixed $b$ and $c$."},{"situation":"When the problem asks for the minimum total count $S = \\sum N_i$ such that $V_{\\max} \\ge V_{target}$, and the solution set is known to be small (e.g., only 3 values for $c$).","suggestion":"Test configurations that maximize the $V_{\\max}$ for $S-1$ (the failing case) and minimize $V_{\\max}$ for $S$ (the succeeding case), focusing on the configuration that is most constrained by the completeness conditions (e.g., setting $b=c-1$ or $b=2$ if $c$ is large)."},{"situation":"When the analysis suggests a contradiction or fails to produce the expected small set of solutions, implying the failure condition ($S-1$) must be due to completeness constraints rather than just $V_{\\max} < V_{target}$.","suggestion":"Isolate the specific denomination $c$ by fixing the smallest possible $N_1$ required by completeness (i.e., $N_1 = b-1$) and analyze how the remaining counts $N_b, N_c$ must partition $S - N_1$ to satisfy the second completeness condition and the $V_{\\max}$ requirement simultaneously."}],"2023_I_1":[{"situation":"When arranging items of two types (e.g., M/W) around a circle with an even number of positions N, where the constraint involves diametrically opposite positions (N/2 pairs).","suggestion":"Define the relationship between opposite positions by classifying the N/2 pairs into three types: Type 1 (M opposite M), Type 2 (W opposite W), and Type 3 (M opposite W). Set up a system of linear equations based on the total counts of each item type and the total number of pairs."},{"situation":"When a specific constraint forces certain pair types to be zero (e.g., 'no M opposite M' implies Type 1 pairs = 0).","suggestion":"Solve the resulting system of equations to determine the exact required number of the remaining two pair types (e.g., required Type 2 and Type 3 counts). Verify that the counts sum correctly to N/2."},{"situation":"When the required configuration of pair types is determined (e.g., $k$ pairs of Type 1, $l$ pairs of Type 2, $p$ pairs of Type 3).","suggestion":"Calculate the number of favorable arrangements by first choosing which of the N/2 physical pairs will correspond to Type 3 (M-W) pairs: $\\binom{N/2}{p}$. Then, for each of the $p$ M-W pairs, multiply by the number of ways to assign the roles (2 ways: M on side A, W on side B, or vice versa), resulting in a factor of $2^p$."},{"situation":"When calculating the total sample space for assigning $M$ items of one type and $W$ items of another type to $N=M+W$ fixed positions around a circle.","suggestion":"Calculate the total arrangements as $\\binom{N}{M}$ (treating the positions as distinguishable slots, which is standard before considering rotational symmetry unless the problem explicitly asks for distinct rotational configurations)."}],"2023_I_2":[{"situation":"When an equation involves logarithms with the same base but different arguments, such as $\\log_b A = \\log_b B$ or $\\log_b (A \\cdot B) = C$.","suggestion":"Systematically apply logarithm properties ($\\log(x^r) = r \\log x$, $\\log(xy) = \\log x + \\log y$, $\\log_b b = 1$) to rewrite all terms in terms of $x = \\log_b n$ (or a similar substitution) to transform the transcendental equation into an algebraic one."},{"situation":"When an algebraic equation derived from a transcendental system yields multiple potential solutions (e.g., $x=0$ and $x=4$ from $x^2-4x=0$).","suggestion":"Test each potential solution against the constraints imposed by the *other* equations in the system, especially those that introduced domain restrictions (like requiring the argument of a logarithm or square root to be non-zero or positive) or those that were simplified by assuming a non-zero variable."},{"situation":"When an equation simplifies to $x(b-1)=1$ where $x$ is related to $\\log_b n$ and $b$ is the base.","suggestion":"Recognize that this structure forces $x$ to be non-zero, allowing the elimination of the $x=0$ case derived from other parts of the system, and use this relationship to solve for the base $b$ in terms of $x$."},{"situation":"When the final answer requires the sum of the numerator and denominator of a fraction $n=j/k$ that resulted from solving for an exponential quantity $n=b^r$.","suggestion":"Ensure the resulting fraction $j/k$ is fully reduced by checking the prime factorization of $j$ and $k$ for common factors, then compute the sum $j+k$."}],"2023_I_3":[{"situation":"A set of N lines in a plane where no two are parallel, and the configuration is characterized by the number of points where exactly k lines intersect (n_k).","suggestion":"Establish the identity that the total number of pairs of lines, $\\binom{N}{2}$, must equal the sum of the pairs accounted for at every intersection point: $\\sum_{k \\ge 2} n_k \\binom{k}{2} = \\binom{N}{2}$."},{"situation":"When the total number of intersections P is unknown, but the counts n_k for k >= 3 are known, and the goal is to find n_2 (the number of simple pairwise intersections).","suggestion":"Use the identity derived from counting pairs ($\\sum n_k \\binom{k}{2} = \\binom{N}{2}$) to form a linear equation solely in terms of $n_2$ and the known constants, then solve for $n_2$."},{"situation":"When solving a problem involving the total number of intersections P, and you have already calculated the number of simple intersections ($n_2$) and the number of multiple intersections ($n_k$ for $k \\ge 3$).","suggestion":"Verify the result by calculating the total number of points P using two different methods: (1) Summing the counts: $P = \\sum n_k$, and (2) Subtracting the reduction from the maximum possible points: $P = \\binom{N}{2} - \\sum_{k \\ge 3} n_k \\left( \\binom{k}{2} - 1 \\right)$."}],"2023_I_4":[{"situation":"When a divisor $m$ of $N$ must satisfy a condition related to the parity of the exponents in $N/m$ (e.g., $N/m$ is a perfect square, or $N/m$ is $k$-free).","suggestion":"Determine the prime factorization $N = \\prod p_i^{e_i}$. The condition on $N/m$ translates directly into a parity (or modulo $k$) constraint on the exponent $m_i$ for each prime $p_i$. List all possible exponents $m_i$ satisfying $0 \\le m_i \\le e_i$ and the parity/mod constraint."},{"situation":"When the set of allowed divisors $m$ is determined by independent constraints on the exponents of its prime factors.","suggestion":"The sum of all such divisors $S$ is the product of the sums of the allowed powers for each prime factor: $S = \\prod_i \\left( \\sum_{m_i \\text{ allowed}} p_i^{m_i} \\right)$."},{"situation":"When summing a geometric progression where the ratio $r$ is a perfect square (e.g., summing $1 + r^2 + r^4 + \\dots + r^{2k}$).","suggestion":"Use the standard geometric series formula $\\frac{r^{n}-1}{r-1}$, recognizing that the ratio of the series is $R=r^2$, and the number of terms is $k+1$."},{"situation":"When the final required answer is the sum of the exponents in the prime factorization of the calculated result $S$.","suggestion":"After calculating the component sums $S_i$ for each prime factor, factorize each $S_i$ completely. Then, combine the exponents for each prime across all factors $S_i$ to determine the final prime factorization of $S$ before summing the exponents."}],"2023_I_5":[{"situation":"When distances from a point P on a circle to the vertices of an inscribed square (or rectangle) are related by products.","suggestion":"Set up a coordinate system with the circle's center at the origin (0, 0) and the square's vertices on the axes (if the diagonals align with the axes). Parameterize P as $(x, y)$ subject to $x^2 + y^2 = R^2$."},{"situation":"When calculating squared distances from a point $(x, y)$ on a circle of radius $R$ centered at the origin to vertices $(\\pm R, 0)$ and $(0, \\pm R)$.","suggestion":"Use the distance formula and simplify using $x^2+y^2=R^2$ to find the squared distances in the form $2R^2 \\mp 2Rx$ and $2R^2 \\mp 2Ry$."},{"situation":"When the product of opposite distances (e.g., $PA \\cdot PC$) is given for a point P on the circumcircle of a square ABCD.","suggestion":"Square the given product, substitute the simplified distance expressions, and use the algebraic identity $(A-B)(A+B) = A^2 - B^2$ to relate the product to $R^4$ and the coordinates of P."},{"situation":"When two separate equations involving $R^4$, $x^2$, and $y^2$ are derived from distance products, and the constraint $x^2 + y^2 = R^2$ is known.","suggestion":"Manipulate the derived equations to isolate terms proportional to $x^2$ and $y^2$ respectively, then sum these manipulated equations to eliminate $x$ and $y$ entirely, leaving an equation solely in terms of $R^4$."}],"2023_I_6":[{"situation":"When solving an optimization problem (like expected value maximization) involving sequential choices where the state space is defined by two integer parameters (e.g., counts of two types of items).","suggestion":"Define $E(r, b)$ as the expected future gain from state $(r, b)$. Write the recurrence relation based on the optimal immediate choice, ensuring the coefficients are the probabilities of transitioning to the resulting states, and the recursive terms correctly reflect the expected gain from those subsequent states."},{"situation":"When the state transition in a dynamic programming recurrence depends on which choice is made (e.g., guessing the majority item), leading to different subsequent states based on success or failure.","suggestion":"If $r=b$, use symmetry to simplify the recurrence, noting that $E(r, r) = 1/2 + E(r, r-1)$ (assuming $E(r, r-1) = E(r-1, r)$)."},{"situation":"When a complex expected value calculation yields a result that is difficult to verify through a single DP path, or when the DP recurrence itself was suspected of being set up incorrectly.","suggestion":"Attempt an alternative calculation method, such as summing the probabilities of achieving success at each step ($P_1 + P_2 + \\dots$), and compare the final result to the DP outcome to confirm correctness."},{"situation":"When the optimal strategy involves choosing the option with the highest count (e.g., guessing the majority color in a card problem).","suggestion":"Verify that the expected value calculation correctly incorporates the probability of the chosen action succeeding multiplied by $(1 + E_{\\text{success}})$ and the probability of failure multiplied by $(0 + E_{\\text{failure}})$, where $E_{\\text{success}}$ and $E_{\\text{failure}}$ are the expected values from the resulting states."}],"2023_I_7":[{"situation":"When a set of remainders $\\{r_k\\}$ must satisfy multiple simultaneous congruences $n \\equiv r_k \\pmod{k}$ where the moduli $k$ share common factors (e.g., $k \\in \\{2, 3, 4, 5, 6\\}$).","suggestion":"Use the Chinese Remainder Theorem (CRT) by first simplifying the system based on the relationships imposed by $\\gcd(k, j)$. Specifically, check constraints derived from $n \\equiv r_k \\pmod{k}$ and $n \\equiv r_j \\pmod{j}$ where $k$ divides $j$ (e.g., $2|4, 2|6, 3|6$). If a contradiction arises, the configuration is impossible; otherwise, solve the reduced system modulo $\\text{lcm}$ of the moduli."},{"situation":"When remainders $r_k$ and $r_j$ are constrained by $r_k \\equiv r_j \\pmod{\\gcd(k, j)}$, and the remainders must be distinct.","suggestion":"Analyze the parity or divisibility constraints imposed by the shared factor. If $\\gcd(k, j)=2$, then $r_k$ and $r_j$ must share the same parity. If they must be distinct, they must exhaust all possibilities of that parity within their respective ranges (e.g., if $r_2, r_4, r_6$ must be distinct and share parity, they must be $\\{0, 2, 4\\}$ or $\\{1, 3, 5\\}$)."},{"situation":"When the problem requires finding the count of integers $n < N$ satisfying a system of congruences modulo $M$ (where $M = \\text{lcm}$ of all moduli).","suggestion":"Solve the system to find the unique solution $n \\equiv r \\pmod{M}$. The number of solutions is $\\lfloor (N-1 - r) / M \\rfloor + 1$. Systematically enumerate all possible valid remainder assignments before applying CRT."},{"situation":"When solving a system of congruences using CRT leads to a contradiction for a specific assignment of remainders, even though the local parity/GCD checks passed.","suggestion":"Re-examine the implication of the largest modulus constraint on the smaller ones. For example, if $n \\equiv r_6 \\pmod{6}$, this immediately fixes $r_2 = r_6 \\pmod{2}$ and $r_3 = r_6 \\pmod{3}$. Verify that the required $r_2$ and $r_3$ are consistent with the initial assumptions made for $r_2$ and $r_3$ in the case analysis."}],"2023_I_8":[{"situation":"A point P is located between two parallel lines L1 and L2, and the distances from P to L1 and L2 are given.","suggestion":"The distance between the parallel lines is the sum of the distances from P to each line. If the lines are tangent to an incircle, this sum equals the diameter (2r) of the circle."},{"situation":"When dealing with the area ($A$) of a tangential quadrilateral (like a rhombus) where the inradius ($r$) is known, and the side length ($s$) and an interior angle ($\\alpha$) are unknown.","suggestion":"Relate the area using the standard formulas $A = 2sr$ and $A = s^2 \\sin \\alpha$. Equate them to find a necessary relationship between $s$, $r$, and $\\alpha$, specifically $s \\sin \\alpha = 2r$."},{"situation":"When a point P lies on a circle inscribed within an angle defined by two lines (L_A and L_B), and the distances from P to both lines are known.","suggestion":"Set up a coordinate system placing the vertex of the angle at the origin, align one line along the x-axis, and use the distance formulas for the lines to create two linear equations involving the coordinates of P and the trigonometric functions of the angle ($\\alpha$). Use the circle equation relating P to the incenter O."},{"situation":"When solving a system involving $\\sin \\alpha$ and $\\cos \\alpha$ derived from geometric constraints, especially when one equation relates to the radius/center position and the other relates to a specific point on the circle.","suggestion":"Employ the half-angle substitution ($t = \\tan(\\alpha/2)$) to convert the system into a purely algebraic equation in $t$. Solve the resulting polynomial equation for $t$ and discard solutions inconsistent with the geometric constraints on $\\alpha$ (e.g., $0 < \\alpha < 90^\\circ$ implies $0 < t < 1$)."}],"2023_I_9":[{"situation":"When an algebraic condition on polynomial coefficients leads to a quadratic equation whose roots must satisfy constraints (e.g., being integers or distinct from a specific value).","suggestion":"Analyze the discriminant. If integer roots are required, set the discriminant equal to a perfect square, $k^2$. If the roots must satisfy a specific value (like $m=2$), set the quadratic expression evaluated at that value to zero, which imposes a linear constraint on the coefficients."},{"situation":"When analyzing the roots of a quadratic equation $Ax^2 + Bx + C = 0$ where the roots must be integers, and the discriminant $D=B^2-4AC$ is known to be a perfect square $k^2$.","suggestion":"Use the quadratic formula to express the roots $x = (-B \\pm k) / (2A)$. If $A=1$, the roots are integers if and only if $B$ and $k$ have the same parity, which is automatically guaranteed if $D=k^2$ is derived from integer coefficients $A, B, C$."},{"situation":"When a problem requires finding the number of pairs of coefficients $(a, b)$ that satisfy two distinct structural conditions derived from the root analysis (e.g., $D=0$ vs $D>0$).","suggestion":"Treat the conditions as mutually exclusive cases (Case 1: $D=0$; Case 2: $D=k^2 > 0$). Systematically enumerate all integer solutions within the given bounds for each case, ensuring that the constraints defining the case (e.g., $a$ must be even for $D=0$) are strictly met."},{"situation":"When counting integer solutions $(a, b)$ constrained by inequalities derived from bounds on $b$ (e.g., $-20 \\le b \\le 20$) where $b$ is a linear function of $a$ (e.g., $b = ma + d$).","suggestion":"Translate the bounds on $b$ into bounds on $a$ using the linear relationship. Check the resulting range for $a$ against any other explicit constraints on $a$ (like $a \\neq -6$) and count the integers in the final intersection."}],"2023_I_11":[{"situation":"When counting subsets of $\\{1, 2, \\dots, n\\}$ where no two elements are consecutive.","suggestion":"Define the count for $n$ elements as $C_n$. Establish a recurrence relation based on whether $n$ is included in the subset ($C_{n-2}$) or excluded ($C_{n-1}$), leading to the Fibonacci sequence relationship $C_n = C_{n-1} + C_{n-2}$ (with appropriate base cases, often $C_n = F_{n+2}$)."},{"situation":"When a counting problem requires partitioning based on the location of a required structure (e.g., a specific pair $\\{k, k+1\\}$ must exist) within a sequence of $N$ items.","suggestion":"Iterate over all possible locations $k$ for the structure, handling boundary cases ($k=1$ and $k=N-1$) separately from the interior cases ($1 < k < N-1$), as the boundary conditions affect the constraints on the remaining elements."},{"situation":"When the required structure $\\{k, k+1\\}$ is fixed, forcing the exclusion of its neighbors $\\{k-1, k+2\\}$, thus splitting the remaining selection pool into two independent, non-consecutive selection problems on disjoint sets $S_L$ and $S_R$.","suggestion":"If $S_L$ has size $n_L$ and $S_R$ has size $n_R$, the number of ways to complete the selection is the product of the counts for each set: $C_{n_L} \\cdot C_{n_R}$, where $C_n$ is the count for the non-consecutive subset problem."}],"2023_I_12":[{"situation":"When solving a geometry problem involving a point inside an equilateral triangle where the point forms equal angles ($\\theta$) with the segments connecting it to the vertices' division points.","suggestion":"Attempt to apply the generalized trigonometric formula relating $\\cot \\theta$ to the ratios of the segments created by the division points on the sides. If the result is complex, suspect that the problem configuration is a known special case (like $\\theta=60^\\circ$) intended to simplify the algebra."},{"situation":"When coordinate geometry or direct trigonometric application yields a highly complicated algebraic expression for a quantity expected to be simple (e.g., an integer or a simple rational number) in a contest setting.","suggestion":"Re-examine the problem statement for implicit geometric constraints or special configurations that force simplification. If the problem is known, verify if the given parameters match a known configuration that yields a simple answer, even if the initial general formula seems to contradict it."},{"situation":"When setting up coordinate geometry for an equilateral triangle, especially when dealing with angles relative to the sides.","suggestion":"Fix the triangle in the coordinate plane (e.g., base on the x-axis) and use slopes derived from the $60^\\circ$ angles of the sides. Systematically check the orientation (CW vs CCW) of the angle $\\theta$ relative to the coordinate axes for each vertex to ensure consistent application of the slope formula $m = \\tan(\\alpha \\pm \\theta)$."}],"2023_I_13":[{"situation":"When the volume of a parallelepiped is determined by the lengths of its three edges (all equal, $s$) and the angles between them ($\\alpha, \\beta, \\gamma$).","suggestion":"Use the formula $V^2 = s^6 (1 + 2 \\cos \\alpha \\cos \\beta \\cos \\gamma - \\sum \\cos^2 \\theta)$ and relate the face angles (derived from given diagonal lengths) to the edge angles using the Law of Cosines on the faces."},{"situation":"When the faces of a parallelepiped are identical rhombi defined by two diagonals ($d_1, d_2$) and all edges have length $s$.","suggestion":"Calculate the edge length $s$ using $s^2 = (d_1^2 + d_2^2)/4$. Then, calculate the cosine of the face angle $\\theta$ using $d_1^2 = 2s^2(1 - \\cos \\theta)$ or $d_2^2 = 2s^2(1 + \\cos \\theta)$."},{"situation":"When the geometry of a solid (like a parallelepiped) is determined by a set of fundamental parameters (like edge length $s$ and face angle $\\theta$), but the structure allows for two distinct configurations based on how these angles are assigned to the three meeting edges.","suggestion":"Identify the two distinct assignments of the possible edge angles ($\\theta$ and $180^\\circ - \\theta$) to the three edges meeting at a vertex. Calculate the squared volume $V^2$ for each assignment separately using the general volume formula."},{"situation":"When the ratio of two geometric quantities ($V_L/V_S$) is required, and both quantities are derived from the same base parameters but differ only by the sign of a term involving the product of cosines (e.g., $1 \\pm 2c^3$). ","suggestion":"Calculate the squares of the quantities ($V_L^2$ and $V_S^2$) explicitly, simplify the expressions by finding a common denominator related to the parameter ($c$), and then take the square root of the ratio of the squares to find the final ratio."}],"2023_I_14":[{"situation":"When counting paths or sequences in a grid graph defined by $\\mathbb{Z}_m \\times \\mathbb{Z}_n$ where the path must visit every vertex exactly once (a Hamiltonian cycle).","suggestion":"Decompose the path into blocks corresponding to the modulus $m$ (or $n$). The condition for visiting all residues in one coordinate requires that the cumulative sum of the step counts within those blocks generates all residues modulo $m$. This is equivalent to checking that the GCD of the total steps in $m-1$ blocks is coprime to $m$."},{"situation":"When counting sequences of length $T$ composed of $k$ types of steps, subject to constraints on the total count of each step type, and the constraints involve modular arithmetic (e.g., returning to the origin).","suggestion":"Use generating functions $P(x)$ where the coefficients encode the number of ways to choose the steps within a block, and apply the method of roots of unity to enforce the modular constraints on the cumulative sums."},{"situation":"When using roots of unity $\\omega^j$ to enforce a condition like $\\gcd(C, M)=1$ within a sum involving powers of $\\omega^j$.","suggestion":"Analyze the resulting expression $S = \\sum_{j=0}^{M-1} f(j) \\omega^{jC}$. If the function $f(j)$ has symmetries (e.g., $f(\\omega^j)$ is real, or $f(j)$ is zero for certain $j$), systematically cancel or group terms corresponding to roots of unity that yield zero contribution or are complex conjugates."},{"situation":"When solving a final congruence $A N \\equiv B \\pmod{M}$ where $\\gcd(A, M) = d > 1$.","suggestion":"If $B$ is divisible by $d$, the congruence reduces to $(A/d) N \\equiv (B/d) \\pmod{M/d}$. Since $\\gcd(A/d, M/d) = 1$, a unique solution exists modulo $M/d$. Use the extended Euclidean algorithm or modular inverse to find $N$ modulo $M/d$ and then state the solution modulo $M$ (which will have $d$ solutions, but the context usually implies the smallest positive integer solution)."}],"2023_I_15":[{"situation":"When a problem involves geometric constraints on the side lengths of a triangle derived from algebraic expressions (like $A, B, C$ being side lengths derived from $z^n$ where $z=x+iy$ is a Gaussian integer).","suggestion":"Verify the triangle inequality constraints ($A+B>C$, etc.) algebraically. If the expressions for $A, B, C$ are homogeneous polynomials of the same degree in $x$ and $y$, analyze the inequality by substituting $x=ry$ and checking the resulting inequality in $r$ (the ratio of the coordinates)."},{"situation":"When an integer $p$ must be represented as a sum of two squares, $p = x^2 + y^2$, and the resulting expressions derived from $p$ (like $A$ and $B$) must satisfy a specific inequality involving $p$ (e.g., $|A-B| < p$).","suggestion":"Use the identity relating the algebraic expressions to $p$ (e.g., $A^2+B^2=p^3$) to rewrite the inequality. Then, express the relationship between $x$ and $y$ using the ratio $r=x/y$ and determine the optimal range for $r$ that minimizes the left side of the inequality relative to the right side."},{"situation":"When searching for the largest integer $p$ less than a bound $N$ that satisfies a number-theoretic condition derived from a sum-of-squares representation ($p=x^2+y^2$) and an algebraic constraint on $x$ and $y$.","suggestion":"Start the search from $N$ downwards. For each candidate $p$, check if $p \\equiv 1 \\pmod{4}$ (or $p=2$). If so, find all integer partitions $(x, y)$. Test each partition against the derived algebraic constraint. If the constraint is highly sensitive to the ratio $x/y$, prioritize testing partitions whose ratio is closest to the theoretically optimal value."},{"situation":"When the required condition forces the ratio of two variables ($x/y$) to be close to a specific algebraic irrational number (e.g., $2+\\sqrt{3}$).","suggestion":"Systematically test integer ratios $x/y$ that are rational approximations of the target irrational number, starting with low denominators, as these often correspond to the solutions for small/moderate primes $p$."}],"2023_II_1":[{"situation":"When the sum ($S_n$) and the relationship between the extreme terms ($a_1$ and $a_n$) of an arithmetic sequence are known.","suggestion":"Immediately use the sum formula $S_n = \\frac{n}{2}(a_1 + a_n)$ to establish a linear relationship between $a_1$ and $a_n$, and combine this with the given ratio/difference condition to form a solvable 2x2 system for the extreme terms."},{"situation":"When the first term ($a_1$) and the last term ($a_n$) of an arithmetic sequence are related by a simple multiplicative factor (e.g., $a_n = k \\cdot a_1$).","suggestion":"Substitute the multiplicative relationship directly into the sum equation derived from $S_n$ to eliminate one variable, allowing for immediate calculation of the remaining extreme term."},{"situation":"When the terms of an arithmetic sequence are constrained to be positive integers, and the relationship between the first and last term is $a_n = k \\cdot a_1$.","suggestion":"Use the relationship $a_n = a_1 + (n-1)d$ to find the common difference $d$ in terms of $a_1$, and verify that $d$ is an integer (or that $a_1$ is divisible by the required factor, $n-1$, if $k$ is an integer)."}],"2023_II_2":[{"situation":"When searching for the largest integer $N$ below a fixed bound $B$ that satisfies two independent structural properties (e.g., base 10 palindrome and base $R$ palindrome).","suggestion":"Determine the structural form of the numbers satisfying the stricter constraint (the one that limits the range most severely, often related to the higher base $R$ or the bound $B$). Systematically enumerate candidates starting from $B-1$ downwards, checking the second constraint."},{"situation":"When an integer $N$ is constrained to be a palindrome in two different bases, $B_1$ and $B_R$, and the bound $B$ is close to a power of $R$ (e.g., $B \\approx R^k$).","suggestion":"Analyze the structure of $k$-digit palindromes in base $R$. If $B$ is near $R^k$, the largest solutions are likely to be $k$-digit or $(k-1)$-digit palindromes in base $R$. Check the $(k)$-digit base $R$ palindromes first, as they cover the largest numerical range."},{"situation":"When searching for a base 10 palindrome $aba$ or $aa$ that matches a specific algebraic form derived from a different base representation (e.g., $N = c_1 R^3 + c_2 R^2 + c_2 R + c_1$).","suggestion":"Explicitly write out the base 10 value $N$ in terms of its base 10 digits ($101a + 10b$ or $11a$) and equate it to the base $R$ expression. Solve the resulting Diophantine equation by iterating over the leading digit of the base $R$ representation (which is constrained by the bound $B$) and checking if the resulting $N$ satisfies the base 10 palindrome structure."}],"2023_II_3":[{"situation":"When a point P inside a triangle ABC is defined by equal angles subtended at the vertices, i.e., $\\angle PAB = \\angle PBC = \\angle PCA = \\alpha$.","suggestion":"Calculate the remaining angles ($\\angle PAC, \\angle PBA, \\angle PCB$) in terms of $\\alpha$ and the base angles of $\\triangle ABC$. Use the sum of angles in $\\triangle APC$ to check if $\\angle APC$ is a fixed value (like $90^{\\circ}$), which simplifies subsequent trigonometric relations."},{"situation":"When two different geometric constraints (derived from different triangles sharing the point P) yield two different expressions for a common side length (like $s$ in this case).","suggestion":"Set the two expressions for the common side length equal to each other. Use angle sum identities (like $\\sin(A-B)$) to simplify the resulting trigonometric equation until it isolates a single trigonometric function of $\\alpha$ (e.g., $\\tan \\alpha = k$)."},{"situation":"When a side length $s$ is related to an angle $\\alpha$ via $s = K / \\sin \\alpha$ (derived from a right triangle relationship) and also via the Law of Sines in an adjacent triangle.","suggestion":"Use the derived value of $\\tan \\alpha$ to immediately find the required value of $\\sin \\alpha$ (using the Pythagorean identity or a reference triangle) and substitute this directly into the simpler expression for $s$ to find the side length."},{"situation":"When using the Law of Sines in a triangle where one angle is $135^{\\circ}$ (derived from a $45^{\\circ}$ base angle and an angle $\\alpha$).","suggestion":"Substitute $\\sin(135^{\\circ}) = \\sqrt{2}/2$ and simplify the resulting expression involving $\\sin(45^{\\circ} - \\alpha)$ to create a linear relationship between $\\sin \\alpha$ and $\\cos \\alpha$ after expansion."}],"2023_II_4":[{"situation":"A system of symmetric polynomial equations where subtracting pairs of equations yields factors involving differences of variables (e.g., $(x-y) \\cdot (\\text{expression}) = 0$).","suggestion":"Analyze the resulting factor equations. If the non-trivial factor (the expression) leads to a contradiction when variables are assumed distinct, then the zero factor (the difference of variables, e.g., $x=y$) must hold for some pairs, forcing a case analysis based on equality/inequality of variables."},{"situation":"When a system of symmetric equations simplifies, under the assumption that not all variables are equal, to a set of disjunctions (e.g., $A=0$ or $B=0$, $C=0$ or $D=0$, etc.).","suggestion":"Test the case where all 'second' conditions hold (e.g., $B=0, D=0, \\dots$). If this contradicts the initial assumption (e.g., leads back to the 'all equal' case), then at least one of the 'first' conditions (e.g., $A=0$) must be true, fixing the value of one variable."},{"situation":"When a symmetric system of equations is solved, and the solutions fall into two distinct structural categories: (1) all variables equal, or (2) some variables equal, but not all.","suggestion":"For the 'some equal' case (e.g., $x=y \\neq z$), use the derived structural constraints to force one variable to a specific constant value (often related to the coefficient structure, like the '4' in the original problem), and then solve the resulting simpler system for the remaining variables."},{"situation":"When the final goal is to find the sum of squares of all possible values a single variable can take across all valid solutions to a symmetric system.","suggestion":"Systematically enumerate all solution types (all equal, two equal, all distinct) based on the structural analysis, collect the unique values attained by the target variable in each type, and sum their squares."}],"2023_II_5":[{"situation":"When analyzing a rational number $r=a/b$ (in lowest terms) where a condition involves the sums of the numerator and denominator of $r$ and a scaled version $Kr$ (where $K$ is an integer).","suggestion":"Let $d = \\gcd(K, b)$. Express the lowest terms representation of $Kr$ as $a'/b'$, where $a' = Ka/d$ and $b' = b/d$. Set up the equality condition $a+b = a'+b'$ and rearrange it to isolate $a$ and $b$ in terms of $d$ to find the ratio $a/b$."},{"situation":"When the derived relationship between $a$ and $b$ is linear, $b(d-1) = a(K-d)$, and $d$ must be a divisor of $K$.","suggestion":"Test all possible divisors $d$ of $K$. Eliminate cases where $d-1$ and $K-d$ have opposite signs (which forces $a=0$ or $b=0$). For the remaining valid $d$, determine the ratio $a/b = (d-1)/(K-d)$, reduce this fraction to lowest terms $(a_0/b_0)$, and then verify that the original constraint $d = \\gcd(K, b_0)$ is satisfied."},{"situation":"When the problem requires finding all rational numbers $r=a/b$ satisfying a structural constraint, leading to a finite set of solutions $S$.","suggestion":"Calculate the required final quantity (e.g., sum, product) by explicitly summing/multiplying the elements of $S$ after ensuring all elements are in lowest terms and that the set $S$ is complete based on the derived constraints."}],"2023_II_6":[{"situation":"When calculating the probability density function (PDF) of a sum of two independent uniform random variables $U=u_1+u_2$ over $[0, 2]$, and then using this to find the PDF of a transformed variable $M=(X, Y)$ where $X$ and $Y$ are linear combinations of $U$ and another independent sum $V$.","suggestion":"Use the change of variables formula $f_M(x, y) = f_{U, V}(u(x, y), v(x, y)) \\cdot |J^{-1}|$. Crucially, verify the total integral of the resulting density $f_M$ over its support region $R_M$. If the support $R_M$ is a scaled version of the support of $(U, V)$, the total mass $\\iint_{R_M} f_M(x, y) dx dy$ will generally not be 1, requiring careful normalization when calculating volumes/probabilities."},{"situation":"When calculating the volume of favorable pairs $(A, B)$ in a product space $S_A \\times S_B$, where $A$ and $B$ are chosen uniformly from unit squares, and the condition depends on the midpoint $M = (A+B)/2$ relative to a fixed region $R$.","suggestion":"Decompose the problem based on which unit square $A$ and $B$ fall into. For a specific pair of squares $S_i, S_j$, the volume $V_{ij}$ is given by $V_{ij} = \\frac{1}{4} \\iint_{S_i \\times S_j \\cap \\{ (A, B) : (A+B)/2 \\in R \\}} dA dB$. If the resulting midpoint region $R_{ij}^M$ is simple (e.g., a square), use the derived density function $f_M(x, y)$ to calculate the integral over the favorable intersection $R_{ij}^M \\cap R$ and multiply the result by $1/4$."},{"situation":"When calculating the integral of a density function $f(t)$ over a region defined by $t \\in [a, b]$ where $f(t)$ is piecewise linear (triangular distribution, resulting from the sum of two uniforms).","suggestion":"Calculate the integral over the full support region $P_{\\text{total}}$ and the integral over the excluded region $P_{\\text{excluded}}$ separately. The favorable integral is $P_{\\text{favorable}} = P_{\\text{total}} - P_{\\text{excluded}}$. If the density is separable, $f_M(x, y) = C \\cdot g(x) h(y)$, then the integral over a rectangular region is the product of the one-dimensional integrals."},{"situation":"When a complex probability calculation yields a final fraction $m/n$ where $n$ is highly composite (e.g., powers of 2 and 3) and $m$ is a product of two moderately large primes.","suggestion":"Perform prime factorization on both the numerator $m$ and the denominator $n$ to confirm they are coprime before summing them ($m+n$). If they are coprime, the fraction is fully reduced."}],"2023_II_7":[{"situation":"When a geometric configuration (like vertices of a regular polygon) is partitioned into independent subsets (like diameters or pairs of opposite vertices) such that the required structure (like a rectangle) is formed by choosing two distinct subsets.","suggestion":"Define the structure based on the selection of two subsets, count the total number of structures ($\\binom{N}{2}$), and translate the coloring constraint into a restriction on the types of the chosen subsets (e.g., $N_{RR} \\le 1$ and $N_{BB} \\le 1$)."},{"situation":"When counting configurations based on the number of elements belonging to specific, mutually exclusive categories (e.g., $N_{RR}, N_{BB}, N_{Mixed}$), subject to simple upper bounds on the counts of two categories ($N_A \\le 1, N_B \\le 1$).","suggestion":"Enumerate all possible combinations of the counts $(N_{RR}, N_{BB})$ that satisfy the constraints (e.g., (0,0), (1,0), (0,1), (1,1)). For each combination, use combinations to select which elements fall into those categories, and multiply by the number of internal coloring choices for the remaining elements."},{"situation":"When the coloring of an independent structural unit (like a pair of opposite vertices) has a fixed number of monochromatic options (1 way for RR, 1 way for BB) and a fixed number of mixed options (2 ways for RB/BR).","suggestion":"If $k$ units must be mixed, multiply the combinatorial selection factor by $2^k$ to account for the independent choice between the two mixed colorings for each unit."}],"2023_II_8":[{"situation":"The required quantity is a product of evaluations of a polynomial $f(x)$ at the roots of another polynomial $Q(x)$, i.e., $P = \\prod f(\\omega_k)$ where $Q(\\omega_k)=0$.","suggestion":"Recognize this product as the resultant $\\text{Res}(Q, f)$, and calculate it using the formula involving the roots of the lower-degree polynomial $f(x)$ or the higher-degree polynomial $Q(x)$, paying close attention to the sign factor $(-1)^{\\deg(Q)\\deg(f)}$."},{"situation":"When calculating the resultant $\\text{Res}(Q, f)$ using the roots $\\beta_j$ of $f(x)$, where $Q(x) = x^n - c$ (a cyclotomic polynomial related structure).","suggestion":"Apply the formula $\\text{Res}(Q, f) = (-1)^{nm} \\text{lc}(f)^n \\prod Q(\\beta_j)$, and substitute $Q(\\beta_j) = \\beta_j^n - c$."},{"situation":"When a root $\\beta$ of a polynomial $f(x)$ of degree $m$ satisfies a relation $f(\\beta)=0$, and one needs to calculate a high power $\\beta^k$ where $k > m$.","suggestion":"Use polynomial long division or repeated substitution based on the minimal polynomial relation $f(\\beta)=0$ to reduce $\\beta^k$ to a linear combination of lower powers of $\\beta$, $\\beta^k = a\\beta^2 + b\\beta + c$."},{"situation":"When a product of terms involving the roots $\\beta_j$ of a polynomial $f(x)$ can be factored into two or more simpler products, such as $\\prod (\\beta_j^2 - c^2) = \\prod (\\beta_j - c) \\cdot \\prod (\\beta_j + c)$.","suggestion":"Relate each simpler product $\\prod (\\beta_j \\pm c)$ to the evaluation of $f(x)$ at $\\pm c$ using the identity $\\prod (\\beta_j - c) = (-1)^m f(c)$ or $\\prod (\\beta_j + c) = (-1)^m f(-c)$, where $m$ is the degree of $f$."}],"2023_II_9":[{"situation":"When a geometric configuration involves a line segment (like $XY$) parallel to a tangent line ($AB$) of a circle, and the points defining the segment are related to the tangency point ($P$ is involved in both).","suggestion":"Use the property that the distance from the tangency point ($A$) to the parallel chord ($PX$) is equal to the distance from $A$ to the endpoint ($P$) of the chord, i.e., $AP=AX$. This implies that the projection of $A$ onto the parallel line bisects the projection of the segment $PX$ onto the tangent line."},{"situation":"When analyzing two possible configurations (e.g., two possible lengths for a segment $AB$ derived from geometric constraints) that lead to different relative positions of points ($P, Q$) with respect to a line ($AB$).","suggestion":"Test both configurations against a secondary, independent constraint (like the relationship derived from the radical axis $PQ$ intersecting $AB$ at $K$). If one configuration leads to a contradiction (e.g., requiring a negative distance or violating the relationship $KP \\pm KQ = PQ$), discard it and proceed with the consistent configuration."},{"situation":"When the intersection point $K$ of the radical axis $PQ$ and the line $AB$ is known, and $P, Q$ lie on the same side of $AB$ (or opposite sides).","suggestion":"If $P, Q$ are on the same side, $K$ must be external to the segment $PQ$, implying $|KP - KQ| = PQ$. If $P, Q$ are on opposite sides, $K$ must lie between $P$ and $Q$, implying $KP + KQ = PQ$. Use the known ratio of distances $r = h/h' = KP/KQ$ to solve for $KP$ and $KQ$ in terms of $PQ$ and $r$."},{"situation":"When the height $h$ between two parallel chords ($XY$ and $AB$) is related to the radii ($R_1, R_2$) of the circles they belong to, and the chord lengths are known ($c_1, c_2$).","suggestion":"Apply the relationship $2R h = h^2 + (c/2)^2$, where $c$ is the chord length, to establish relationships between $R_1, R_2$, and $h$. Then, use the difference $R_2 - R_1$ to find an expression for $h$ involving the known chord lengths."},{"situation":"When the distance $d$ from the center of a circle ($O_1$) to a line ($PQ$) needs to be calculated in two different ways, one using the radius ($R_1$) and the chord length ($PQ/2$), and the other using coordinate geometry involving the slope ($m$) of the line $PQ$.","suggestion":"Set the two expressions for $d^2$ equal: $R_1^2 - (PQ/2)^2 = \\frac{(y_{O_1} - y_{PQ})^2}{1 + m^2}$. Substitute known expressions for $R_1$ (in terms of $h$) and the slope $m$ (in terms of $h$) to derive a polynomial equation solely in terms of $h^2$."}],"2023_II_10":[{"situation":"When coloring a graph (especially a highly structured one like a grid or bipartite graph) such that adjacent vertices must have different colors, and the number of available items for each color class is fixed and equal.","suggestion":"Identify the graph's bipartition sets (A and B). Determine the required distribution of colors across A and B by ensuring the total counts match the fixed item counts, using the sizes of A and B to constrain the possible partitions."},{"situation":"When analyzing local constraints on a graph coloring where the graph is regular (e.g., 3-regular) and the color sets are constrained by size.","suggestion":"For any vertex $v$ of color $k$, analyze the required distribution of its neighbors' colors across the other two color classes ($k', k''$). Set up a system of linear equations based on the total counts in the partition sets to find the possible configurations of local color patterns."},{"situation":"When counting the number of ways to assign labels (colors) to sets that satisfy complex local consistency rules derived from graph structure.","suggestion":"Enumerate all structurally distinct solutions to the consistency system (e.g., $(x_0, x_1, x_2)$ configurations). For each configuration, calculate the number of ways ($W$) to assign the local patterns within the fixed sets $A_k$ and $B_k$ that satisfy the global requirements, summing these ways."},{"situation":"When the final count $N$ is derived by multiplying several independent combinatorial factors (choosing sets, permuting labels, realizing colorings, assigning specific values).","suggestion":"Factor the expression for $N$ completely into prime powers as early as possible. Use the prime factorization to systematically calculate the number of divisors $\\tau(N)$ using the product formula $\\prod (e_i + 1)$."}],"2023_II_11":[{"situation":"When analyzing an intersecting family $\\mathcal{C}$ of subsets of a set $S$ of size $n$, where $|\\mathcal{C}| = 2^{n-1}$ (exactly half the size of the power set).","suggestion":"Invoke the theorem stating that any such family must be a 'star' family, meaning it consists of all sets containing a specific element $x \\in S$. Count the number of possible choices for this central element $x$."},{"situation":"When a set system $\\mathcal{F}$ is defined by a property involving complements (e.g., $A \\cap B \\neq \\emptyset$ is equivalent to $A^c \\cup B^c \\neq S$).","suggestion":"Test the equivalence rigorously on a small, known counterexample (like $n=3$) to ensure the structural implication (e.g., Transversal $\\implies$ Intersecting) holds, as algebraic equivalence might fail to capture necessary boundary conditions or constraints imposed by the specific set partition."},{"situation":"When analyzing a collection $\\mathcal{C}$ of subsets where the empty set $\\emptyset$ is excluded, and the remaining sets partition into pairs $\\{A, A^c\\}$.","suggestion":"If $|\\mathcal{C}|$ is large enough (specifically, if $|\\mathcal{C}|$ exceeds the number of pairs, $2^{n-1} > 2^{n-2}$), prove that the full set $S$ must be included in $\\mathcal{C}$ to satisfy the size requirement while maintaining the intersection property across the pairs."}],"2023_II_12":[{"situation":"When a point P is defined by the intersection of a line passing through a known point (like a median midpoint M) and a circle, and the power of that known point M with respect to the circle is easily calculated.","suggestion":"Use the power of a point theorem ($MA \\cdot MP = R^2 - OM^2$ or $MA \\cdot MP = BM \\cdot MC$ if M is on a chord) to find the ratio or distance $MP$ relative to $MA$, allowing for the precise coordinate determination of $P$ via vector scaling along the line $AM$."},{"situation":"When a point Q lies on a segment AM and satisfies an angular condition involving points B and C, such as $\\angle PBQ = \\angle PCQ$, leading to a ratio constraint $BQ/CQ = k$ (Apollonius circle).","suggestion":"If the initial angle interpretation leads to a contradiction with the geometric constraint ($Q$ must lie on segment $AM$), systematically test the alternative angle pairing (e.g., swapping the roles of $\\beta$ and $\\gamma$ in the angle sum) to find the correct ratio $k$ that yields a solution consistent with the segment location."},{"situation":"When a point Q must lie on a specific line segment (e.g., a median) and simultaneously on a circle defined by a constant ratio of distances to two fixed points (Apollonius circle).","suggestion":"Determine the two points ($D', E'$) that divide the segment $BC$ internally and externally by the required ratio $k$. Use these points as the diameter to define the Apollonius circle equation, then solve the resulting system of equations by substituting the line equation ($y=mx+c$) into the circle equation."},{"situation":"When calculating the final answer requires simplifying an expression involving a square root in the denominator, $X = m/\\sqrt{n}$, and the final required form is $m'+n'$ where $m'$ and $n'$ are coprime integers.","suggestion":"Ensure the expression is reduced to lowest terms by factoring the term under the radical ($n$) and rationalizing the denominator. Then, check the greatest common divisor of the resulting numerator ($m$) and the simplified radical term ($n$) to confirm they are coprime before summing."}],"2023_II_13":[{"situation":"When an expression involves powers of two quantities, $x$ and $y$, which are roots of a quadratic equation $t^2 - b t + c = 0$, where $b$ and $c$ are integers.","suggestion":"Define $P_k = x^k + y^k$. Establish the linear recurrence relation $P_{k+2} = b P_{k+1} - c P_k$ and use the initial integer values $P_0 = 2$ and $P_1 = b$ to prove $P_k$ is always an integer."},{"situation":"When an expression $X_n = \\alpha^n + \\beta^n$ is required to be an integer, but $\\alpha$ and $\\beta$ are quadratic irrationals (e.g., involving $\\sqrt{D}$), and $X_n$ is not an integer for all $n$.","suggestion":"Examine the structure of $\\alpha$ and $\\beta$. If $\\alpha = a + b\\sqrt{D}$ and $\\beta = a - b\\sqrt{D}$ (conjugates), $X_n$ is always an integer. If $\\alpha$ and $\\beta$ are not conjugates, test small values of $n$ to determine the necessary structural constraint on $n$ (e.g., $n$ must be a multiple of 4) that forces the irrational parts to cancel out."},{"situation":"When a sequence $U_m$ is defined by a linear recurrence relation $U_{m+2} = b U_{m+1} - c U_m$ (with integer coefficients $b, c$) and the goal is to find how many terms satisfy a modular condition (e.g., $U_m \\equiv k \\pmod{M}$).","suggestion":"Analyze the sequence of residues $U_m \\pmod{M}$. Since the sequence is determined by the previous two terms, it must eventually become periodic. Calculate terms until the initial pair $(U_0, U_1)$ repeats, determine the period length, and count the occurrences of the desired residue within that period."},{"situation":"When an initial trigonometric equation simplifies to a quadratic equation in $\\sin A$ or $\\cos A$, leading to an irrational value for the trigonometric function.","suggestion":"Use the derived value to calculate the required quantities (like $\\sec^2 A$ and $\\tan^2 A$) and look for a relationship between them that results in a simpler pair of numbers (e.g., conjugates or numbers satisfying a simpler quadratic) when raised to a higher power (e.g., squaring or taking the fourth power)."}],"2023_II_14":[{"situation":"When geometric constraints (e.g., rectangle properties) combined with linear constraints (e.g., heights relative to a plane) lead to an algebraic contradiction (e.g., $8 = 12$).","suggestion":"Assume the linear constraint (perpendicularity to the plane, implying linear height variation) is the intended structural property, and re-evaluate the geometric constraints, often by assuming one dimension is zero or that the side lengths are fixed to a convenient integer value suggested by the input data."},{"situation":"When calculating the volume of water remaining in a cube cut by a plane, and the problem statement is inconsistent, but a rational answer is expected.","suggestion":"Assume the cutting plane is parallel to one face of the cube (i.e., one direction cosine $k_i=0$), fix the cube side length $s$ to a value suggested by the input data (e.g., $s=10$ if heights are around 10), and calculate the volume using integration over the base defined by the other two dimensions."},{"situation":"When calculating the volume of a region defined by a linear height function $z = ax + by + c$ over a rectangular base $[0, L] \\times [0, W]$ under the constraint $0 \\le z \\le H$.","suggestion":"Calculate the volume of the region below the plane $z=7$ over the base using the average height formula: $V_{avg} = L W \\cdot \\text{Average}(z)$. Then, systematically adjust this volume by subtracting or adding the volume outside the physical boundaries ($z<0$ or $z>H$) using volume formulas for truncated prisms or tetrahedra."},{"situation":"When the height function $z = k_x x' + k_y y' + k_z z'$ is determined by projections onto the cube axes, and the plane is perpendicular to the $z'$ axis ($k_z=0$).","suggestion":"Parameterize the height $z$ as a linear function of the two remaining coordinates, $z = a x' + b y'$, where $a$ and $b$ are derived from the known height differences divided by the side length $s$. The volume calculation simplifies to finding the average value of $z$ over the square base $[0, s] \\times [0, s]$ and multiplying by $s^2$ (for the volume below $z=7$ if $c=7$)."}],"2023_II_15":[{"situation":"When analyzing a sequence defined by a linear recurrence relation involving division by 2 (or powers of 2) based on parity, especially when the recurrence involves a constant offset (like $m_{n+1} = (m_n + C)/2$ for odd $m_n$).","suggestion":"Track the sequence modulo a small power of 2 (e.g., modulo 4) to determine the transition rules between states (even/odd, $1 \\pmod 4$, $3 \\pmod 4$) and look for a repeating cycle in the sequence of states."},{"situation":"When a recurrence relation generates a sequence of values $m_n$ that eventually cycles back to a previous value ($m_{n+L} = m_n$), and the solutions depend on the parity of $m_n$ or $m_n$ modulo a small constant.","suggestion":"Define the cycle based on the sequence of 'odd' terms $m^{(i)}$ that initiate the next block of divisions. Determine the length $L$ of this cycle and the total step size $\\Delta n$ in the index $n$ corresponding to one full cycle of $i$. Then, count the number of solutions generated per cycle."},{"situation":"When solutions $n$ are generated in blocks of length $k$ (e.g., if $m_n$ is divisible by $2^k$, yielding $k$ consecutive solutions $n, n+1, \\dots, n+k-1$).","suggestion":"When analyzing the cycle, identify the specific term $m^{(i)}$ that leads to a block of $k$ solutions. If $m^{(i)} = 2^k \\cdot q + r$, the number of solutions generated is $k$, provided the subsequent terms $m_{n+1}, \\dots, m_{n+k-1}$ remain even, which is guaranteed if $m^{(i)}$ is the first odd term encountered after a sequence of divisions."},{"situation":"When counting solutions up to a large limit $N$ based on a periodic pattern of length $L$ that generates $S$ solutions per period, where the period index $i$ relates to the solution index $n$ via $n \\approx i \\cdot (\\Delta n / L)$.","suggestion":"Calculate the number of full periods $K$ such that the index of the last solution generated by the $K$-th period, $n_{max}(K)$, is less than or equal to $N$. Calculate $K \\cdot S$ solutions. Then, explicitly trace the first few steps of the $(K+1)$-th period until the index $N$ is exceeded, counting any additional solutions found."}]}